[{"pk": 705422, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 211919, "date": "2017-03-28", "report": "Teacher Emily (0721709318) called  concerned about connecting  this device  to the CAP then using Netsupport.I took her through the connection process and netsuport functions such as lock and show functions thus resolved.", "serial_number": "GOKMOESTLDD2060055", "error_code": "LDD-NETWORK"}}, {"pk": 379887, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 211855, "date": "2017-07-28", "report": "Mr Jackson 727981786 called concerned that this device was requesting for administrator password. I advised him to use the student account and he was able to see the desktop. Issue resolved", "serial_number": "GOKMOESTLDD2278600", "error_code": "LDD-SOFTWARE"}}, {"pk": 632171, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203541, "date": "2017-07-19", "report": "Madam Consolata 724653076 called concerned that she was unable to see projection when she connected the VGA cable to the TDD and this device. I advised her to click on source and select VGA and she was able to see the projection. Issue resolved.", "serial_number": "q72g646aaaaac0876", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 908986, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203541, "date": "2017-07-19", "report": "Madam Mugo 724653076 called concerned that the device was not producing sound.On probing i realized that she was using the VGA cable thus advised her that the VGA cable only projects video but not audio so if she wants both she could use the HDMI which she said she is going to look for then connect.", "serial_number": "Q72G646AAAAAC0876", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 787865, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203406, "date": "2017-07-13", "report": "Madam Charity 724863471 called concerned that this device was not producing sound when she tried playing a content. I advised her to play a content and she could still not get the volume. I then took her through the cold booting procedure and advised her to play a content and she was able to get the sound. Issue resolved.", "serial_number": "GOKMOESTTDD2005586", "error_code": "TDD-SOUND"}}, {"pk": 259752, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203406, "date": "2017-07-13", "report": "Madam Charity 724863471 called concerned that she was unable to sign in using the teachers account on this device. I took her through the cold booting procedure and she was able to see the desktop icons. Issue resolved.", "serial_number": "GOKMOESTTDD2005633", "error_code": "TDD-HANGING"}}, {"pk": 787865, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203406, "date": "2017-07-13", "report": "Madam Charity 724863471 called concerned that this device was not producing sound when she tried playing a content. I advised her to play a content and she could still not get the volume. I then took her through the cold booting procedure and advised her to play a content and she was able to get the sound. Issue resolved.", "serial_number": "GOKMOESTTDD2005586", "error_code": "TDD-SOUND"}}, {"pk": 259752, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203406, "date": "2017-07-13", "report": "Madam Charity 724863471 called concerned that she was unable to sign in using the teachers account on this device. I took her through the cold booting procedure and she was able to see the desktop icons. Issue resolved.", "serial_number": "GOKMOESTTDD2005633", "error_code": "TDD-HANGING"}}, {"pk": 44057, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203479, "date": "2017-06-30", "report": "Madam Anne 722472397 called us today in regards to this device which was reported faulty by the technician who were installing the devices,he confirmed that the device was not powering on. I advised the teacher to isolate the device a technician will be sent to the school.", "serial_number": "gokmoestldd2247436", "error_code": "LDD-DOA-NOT-POWERING-ON"}}, {"pk": 422388, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202173, "date": "2016-09-29", "report": "Mr James (0728321870) called in regards to this device which was not powering on,i asked the teacher to connect it to the charger and press on the power button for at least five seconds to try and power on the device and the  teacher confirmed that the device powered on well.i asked the teacher to charge it for at least five hours.issue resolved.", "serial_number": "GOKMOESTLDD2008266", "error_code": "LDD - NOT POWERING ON"}}, {"pk": 919872, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202173, "date": "2017-03-08", "report": "Teacher Josephine (0723984299) called to inform us that this device was showing an automatic repair error on the screen. I advised him to cold reboot the device and on powering it on the device was working well. Problem solved", "serial_number": "GOKMOESTLDD2009203", "error_code": "LDD - IMAGE"}}, {"pk": 390397, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202173, "date": "2017-03-08", "report": "Teacher Josephine (0723984299) called to inform us that this device was showing an automatic repair error on the screen. I advised him to cold reboot the device and on powering it on the device was working well. Problem solved", "serial_number": "GOKMOESTLDD2008609", "error_code": "LDD - IMAGE"}}, {"pk": 991177, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202151, "date": "2017-03-07", "report": "Mr. Ken Njiru called to inform us that the class 1 science content had an issue. I advised him to get the content direct from the CAP via the connect server AP on the desktop. He was successful and appreciated the help.", "serial_number": "GOKMOESTTDD2005870", "error_code": "TDD - CONTENT"}}, {"pk": 343113, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202151, "date": "2017-03-07", "report": "Mr. Ken Njiru (727816184) called to inform us that this device was knocked down accidentally by a student and that it was no longer working. I advised him to connect it to a working charger and long press on the power button and the CAP powered on. I asked him to connect it to 1 of the TDD's and confirm whether it was working and after the procedure he was successful. problem solved.", "serial_number": "1c497b9d8425", "error_code": "CAP OTHER"}}, {"pk": 481758, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202217, "date": "2017-03-03", "report": "Teacher Ismail called to inform us that when using this device the projection was upside down. I asked him to select menu on the control panel then select the 3rd icon and then select projection to change the image. He successfully managed to change it. Problem solved", "serial_number": "Q72G702AAAAAC0820", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 903740, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202217, "date": "2017-03-03", "report": "Teacher Ismail called for assistance on how to register students on net support using this device. I assisted him in connecting the devices to the CAP network then asked him to launch net support. I asked him to select student register and then prompt the student on the LDD to register and then save on his TDD. He was successful in the process. Problem solved.", "serial_number": "gokmoesttdd2004274", "error_code": "TDD - NETSUPPORT"}}, {"pk": 853893, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213973, "date": "2016-09-16", "report": "POP UP ERROR-Mr Daniel (076571829),called in regards to this device that it was displaying an error message \"your pc did not charge correctly thus ran into a problem\" then it gave him an option of restart and advanced option to be able to correct the error but when he tried the options it displayed ,nothing could be done on the screen,therefore i advised the teacher to long press on the power button for around five seconds (cold boot) and it went off,i later asked the teacher to power on the device and the error was gone,so he verified that the device was now working well.issue resolved.", "serial_number": "GOKMOESTLDD2010083", "error_code": "LDD - SOFTWARE"}}, {"pk": 707485, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213973, "date": "2016-09-26", "report": "TDD NET SUPPORT Mr Daniel-0706571829-Called with a Issue of Net Support not responding after blocking all the students and using the projector to show the student on the white board,I advised the teacher to try and double click on the Net support Icon But there was no respond,i advised him to shut down the TDD and power it on and after that the Net Support responded and he was able to continue with class", "serial_number": "GOKMOESTTDD2000150", "error_code": "TDD - NETSUPPORT"}}, {"pk": 895293, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213973, "date": "2016-10-11", "report": "LDD SOFTWARE-TABLET MODE Mr.Daniel-0706571829 called and informed us he is unable to view desktop icons, I advised him to check if the device was on tablet mode and disable it.He confirmed the device was on tablet mode and after disabling it he was able to view the desktop icon", "serial_number": "GOKMOESTLDD2008732", "error_code": "LDD - SOFTWARE"}}, {"pk": 254290, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213973, "date": "2016-10-11", "report": "Mr.Daniel-0706571829 called and informed us he is unable to view desktop icons, I advised him to check if the device was on tablet mode and disable it. He confirmed the device was on tablet mode and after disabling it he was able to view the desktop icon", "serial_number": "GOKMOESTLDD2010226", "error_code": "LDD - SOFTWARE"}}, {"pk": 926313, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213973, "date": "2016-10-11", "report": "Mr.Daniel-0706571829 called and informed us he is unable to view desktop icons, I advised him to check if the device was on tablet mode and disable it. He confirmed the device was on tablet mode and after disabling it he was able to view the desktop icon", "serial_number": "GOKMOESTLDD2009225", "error_code": "LDD - SOFTWARE"}}, {"pk": 91873, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213973, "date": "2016-10-11", "report": "Mr.Daniel-0706571829 called and informed us he is unable to view desktop icons, I advised him to check if the device was on tablet mode and disable it. He confirmed the device was on tablet mode and after disabling it he was able to view the desktop icon", "serial_number": "GOKMOESTLDD2008720", "error_code": "LDD - SOFTWARE"}}, {"pk": 203853, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213973, "date": "2016-10-11", "report": "LDD NARRATOR ON-Mr. Daniel-0706571829 called to inform us one LDD had a message indicating “WELCOME TO NARRATOR, TAP THREE TIMES WITH FOUR FINGER TO REVIEW FULL TOUCH GESTURE”. I advised him to disable the narrator, ISSUE RESOLVED", "serial_number": "GOKMOESTLDD2009968", "error_code": "LDD - SOFTWARE"}}, {"pk": 420628, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213973, "date": "2016-10-24", "report": "LDD ERROR AFTER BOOT UP-Mr Daniel a teacher from Elangata Enkima (0706571829), called in regards to this device which he said gave him a message \"net support school client computer pf93f8\" immediately when he powered it on,i advised him to cold boot the device and power it on again and he confirmed that the device was now working well and the error message disappeared.issue resolved.", "serial_number": "GOKMOESTLDD2010095", "error_code": "LDD - SOFTWARE"}}, {"pk": 826393, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213973, "date": "2016-10-28", "report": "TDD HANGING-a teacher by the name Mr Daniel(0706571829) called in regards to this device that he was not able to log in to the teachers account.i asked him to cold boot the device.He powered off the device but when he tried to power it back on,the device could not power on,i told him to connect it to the charger and try to power it on but the device still could not power on,i asked him to charge it and leave it to rest until tomorrow and we will give him a call. issue pending.i called the teacher back and he confirmed that the device is now working well.ISSUE RESOLVED.", "serial_number": "GOKMOESTTDD2000150", "error_code": "TDD - HANGING"}}, {"pk": 50318, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213973, "date": "2017-01-16", "report": "PROJECTOR- SOUND Mr Daniel 0706571829 from Elangata Enkima called concerned that the projector  was not producing sound. I advised him to ensure that the volume on the TDD was maximum and that the HDMI cable was firmly connected. I also advised him to adjust the volume to maximum but the call got disconnected.  He later called to inform us that the projector which he had reported earlier for not producing sound is now working. He said, using the projectors control panel,he selected setup then HDMI link and enabled the projector sound.", "serial_number": "Q72G628AAAAAC0905", "error_code": "PROJECTOR- SOUND"}}, {"pk": 547902, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213973, "date": "2017-01-31", "report": "TDD CAP CONNECTION.  Mr Daniel 0706571829 called us today to inform us that the NETSUPPORT was not working. I advised him to switch on the cap and connect the TDD to the cap network. He was able to connect the TDD to the cap network and then launch NETSUPPORT. The issue was not the NETSUPPORT but the TDD connection to the cap since the TDD network icon was deactivated. Issue resolved.", "serial_number": "gokmoesttdd2000150", "error_code": "TDD - SOFTWARE"}}, {"pk": 518242, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213973, "date": "2017-02-02", "report": "Mr.Daniel(0706571829)  called concerned about the TDD being able to power on but could not navigate through the icons.I therefore advised him to cold reboot and after doing so ,he was now able to  navigate through.", "serial_number": "GOKMOESTTDD2000150", "error_code": "TDD - HANGING"}}, {"pk": 385524, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213973, "date": "2017-02-08", "report": "TDD- NET SUPPORT Teacher Daniel 0706571829 called concerned that he was unable to see the toolbar icons from the net support. I advised him to click on view, then select toolbar then click on standard and he was able to see the toolbar icons.", "serial_number": "GOKMOESTTDD2000150", "error_code": "TDD - NETSUPPORT"}}, {"pk": 222249, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213973, "date": "2017-02-08", "report": "LDD- WHIZZING SOUND Mr Daniel 0706571829 called concerned that this device was producing a whizzing sound when playing KICD content. I advised him to cold boot the device by long pressing on the power button and then power it back on. I then advised him to play a content and the device was now working well.", "serial_number": "GOKMOESTLDD2009842", "error_code": "LDD - SOUND"}}, {"pk": 522471, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213973, "date": "2017-02-08", "report": "TOUCH NOT RESPONDINGrnrnMr. Daniel (0706571829) called to inform us that this device's touch screen is not responding. I advised him to cold reboot the device and on powering it on, the touch was still not responding. I asked him to cold reboot it again and set it aside for at least 30minutes then give as a call for more assistance. the teacher called to follow up on an outbound call that we made to him and he confirmed the device is now working well.", "serial_number": "GOKMOESTLDD2010164", "error_code": "LDD - TOUCH SCREEN"}}, {"pk": 429955, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213973, "date": "2017-02-16", "report": "TOUCH NOT RESPONDING Mr. Daniel (0706571829) called to inform us that this device's touch screen is not responding. I advised him to cold reboot the device and on powering it on. The touch responded Problem resolved", "serial_number": "GOKMOESTLDD2010164", "error_code": "LDD - TOUCH SCREEN"}}, {"pk": 110315, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213973, "date": "2017-03-10", "report": "LDD TASKBAR DISPEARING AND APPERARING  Mr. Daniel called to report this device which he explained that he cannot view the taskbar but the desktop icons are there. I advised him to long press on the taskbar go to properties then un tick the Auto-Hide the taskbar and tick on Lock the taskbar for it not to disappear . After following the procedure the device responded and he was able to view the taskbar without disappearing and appearing PROBLEM SOLVED", "serial_number": "GOKMOESTLDD2010041", "error_code": "LDD - SOFTWARE"}}, {"pk": 234618, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213738, "date": "2017-03-31", "report": "LDD NOT CHARGING Philomena -720761586 called to report this device which she explained that it was not charging. I advised her to connect the device to the charger and confirm which LED light she could see and she confirmed that she could see a red LED light. I advised the teacher to leave the device charging for one hour then call us back. Philomena called back after advising her to charge this devices for 1 hour and said after charging the device the battery increased to 11% from zero. I advised her to continue charging until when it is full and in case of any issue she should notify us", "serial_number": "GOKMOESTLDD1183719", "error_code": "LDD - NOT CHARGING"}}, {"pk": 531028, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213738, "date": "2017-03-31", "report": "LDD NOT CHARGING  Philomena -720761586  called to report this device which she explained that it was not charging. I advised her to connect the device to the charger and confirm which LED light she could see and she confirmed that she could see a red LED light. I advised the teacher to leave the device charging for one hour then call us back. Philomena called back after advising her to charge this devices for 1 hour and said after charging the device the battery increased to 11% from zero. I advised her to continue charging until when it is full and in case of any issue she should notify us", "serial_number": "GOKMOESTLDD1155111", "error_code": "LDD - NOT CHARGING"}}, {"pk": 422130, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213925, "date": "2017-05-23", "report": "Teacher Paramoiwa (0725108048) called concerned to be shown on how to register the students and while taking her through the Cap connection,the CAP went off .I therefore advised her to charge the device then call us back so that we assist her better. I called teacher Sara (725108048) today to follow up on an issue they had reported about connecting this device to the CAP. She informed me that they were able to resolve the issue in the presence of the AEO. Problem solved", "serial_number": "GOKMOESTTDD2000745", "error_code": "TDD - NETSUPPORT"}}, {"pk": 447175, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213929, "date": "2017-05-22", "report": "PROJECTOR- CONNECTION Madam Alice and Christine 0712213873 called concerned that she was not able to see the projection when she connected the HDMI cable to the TDD and this device. I advised her to firmly connect the cable to the TDD and the projector then click on source and select HDMI but she was unable to see the projection. I then advised her to click on FN and F5 funtion simultaneously and select duplicate but she was still unable to see the projection. I then advised her to remove the cable and put it back in and she was still unable to see the projection.I then advised her to ensure that the HDMI cable is aligned with the TDD but the call got disconnected. She later called back and confirmed that she could now see the projection after aligning the HDMI cable to the TDD.", "serial_number": "Q72g644aaaaac0086", "error_code": "PROJECTOR CONNECTION"}}, {"pk": 981690, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213929, "date": "2017-05-22", "report": "TDD NETSUPPORT NAVIGATION Alice -712213873 called to be assisted on how she can register students on Net support .I was able to take her through the procedure by advising her to click on register and prompt the student to register which she did successful. PROBLEM SOLVED", "serial_number": "GOKMOESTTDD2001081", "error_code": "TDD - NETSUPPORT"}}, {"pk": 447175, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213929, "date": "2017-05-22", "report": "PROJECTOR- CONNECTION Madam Alice and Christine 0712213873 called concerned that she was not able to see the projection when she connected the HDMI cable to the TDD and this device. I advised her to firmly connect the cable to the TDD and the projector then click on source and select HDMI but she was unable to see the projection. I then advised her to click on FN and F5 funtion simultaneously and select duplicate but she was still unable to see the projection. I then advised her to remove the cable and put it back in and she was still unable to see the projection.I then advised her to ensure that the HDMI cable is aligned with the TDD but the call got disconnected. She later called back and confirmed that she could now see the projection after aligning the HDMI cable to the TDD.", "serial_number": "Q72g644aaaaac0086", "error_code": "PROJECTOR CONNECTION"}}, {"pk": 981690, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213929, "date": "2017-05-22", "report": "TDD NETSUPPORT NAVIGATION Alice -712213873 called to be assisted on how she can register students on Net support .I was able to take her through the procedure by advising her to click on register and prompt the student to register which she did successful. PROBLEM SOLVED", "serial_number": "GOKMOESTTDD2001081", "error_code": "TDD - NETSUPPORT"}}, {"pk": 798716, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213853, "date": "2017-02-07", "report": "LDD- NAVIGATION Teacher Pennina 0715542332 called in regards to this device which was requesting for administrator password. I advised her to sign in with the student account and she was able to see the icons on the desktop. She said that the device was now working well.", "serial_number": "GOKMOESTLDD2020829", "error_code": "LDD - SOFTWARE"}}, {"pk": 810574, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213853, "date": "2017-02-09", "report": "LDD- NAVIGATION Madam Josephine 0715542332 called in regards to this device which was requesting administrator password. She said that the device has powered off and I advised her to connect the device to a working charger but said she will call us back so we could troubleshoot. We later made a follow up and she said that she was able to sign in with the student account and the device was working well.", "serial_number": "GOKMOESTLDD2028452", "error_code": "LDD - SOFTWARE"}}, {"pk": 189110, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213853, "date": "2017-02-14", "report": "TDD- NET SUPPORT ACTIVATION Teacher Pennina called in regards to this device which was requesting for Net support license activation when she tried launching the net support. I advised her to enable internet sharing from her phone and then connect the TDD to the network provided by the phone and it worked. I therefore advised her to launch the net support and click on activate but she said the activate button was inactive. I advised her to close the net support and launch it again but the problem persisted. I advised her to try the procedure as she expects a call from us tomorrow. We later made a follow up call and she confirmed that net support was activated.", "serial_number": "GOKMOESTTDD2000531", "error_code": "TDD - NETSUPPORT"}}, {"pk": 787152, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213853, "date": "2017-03-10", "report": "Teacher Peninah(0717542332) called concerned about this device which was unable to respond to touch.I took her through the process of cold rebooting and the device was now responding to touch.", "serial_number": "GOKMOESTLDD2030694", "error_code": "LDD - TOUCH SCREEN"}}, {"pk": 371173, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213853, "date": "2017-03-10", "report": "Teacher Peninah(0717542332) called concerned about this device which was unable to respond to touch.I took her through the process of cold rebooting and the device was now responding to touch.", "serial_number": "GOKMOESTLDD2030964", "error_code": "LDD - TOUCH SCREEN"}}, {"pk": 782357, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213853, "date": "2017-03-14", "report": "Teacher Josephine (724973645) called to inform us that this device was not responding to touch. I advised her to long press on the power button to cold reboot the device and on powering it on the device worked. Problem solved.", "serial_number": "GOKMOESTLDD2030984", "error_code": "LDD - TOUCH SCREEN"}}, {"pk": 495189, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213853, "date": "2017-03-14", "report": "Teacher Josephine (724973645) called to inform us that this device was not responding to touch. I advised her to long press on the power button to cold reboot the device and on powering it on the device worked. Problem solved.", "serial_number": "GOKMOESTLDD2029422", "error_code": "LDD - TOUCH SCREEN"}}, {"pk": 299748, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213853, "date": "2017-06-20", "report": "Teacher Josephine(0724973645) called concerned being unable to access the desktop icons.On probing ,i realized the device was on tablet mode and therefore took  him through the process of deactivating thus issue solved.", "serial_number": "GOKMOESTLDD2019665", "error_code": "LDD-SOFTWARE"}}, {"pk": 510466, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213853, "date": "2017-07-07", "report": "Madam Josephine 724973645 called in regards to this device which was hanging. I advised the teacher to cold reboot  and upon powering on the device she was able to navigate properly. Issue resolved.", "serial_number": "GOKMOESTLDD2020843", "error_code": "LDD-TOUCH-SCREEN"}}, {"pk": 422384, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213853, "date": "2017-07-07", "report": "Madam Josephine 724973645 called in regards to this device which was showing the task bar on the right hand side. I advised the teacher to drag the task bar to the bottom part of the device then click on the task bar and lock the task bar on the option given. She was able to lock the task bar and the device is working well. Issue resolved.", "serial_number": "GOKMOESTLDD2020829", "error_code": "LDD-SOFTWARE"}}, {"pk": 303049, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213749, "date": "2017-05-25", "report": "LDD- SOFTWARE Christine 0705441545 called concerned that he was unable to see the desktop icons from this device. I took her through the procedure of cold booting the device by long pressing on the power button until the device shuts down then power it back on and she was now able to see the desktop icons. Issue resolved.", "serial_number": "GOKMOESTLDD2123518", "error_code": "LDD - SOFTWARE"}}, {"pk": 345947, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213749, "date": "2017-05-25", "report": "LDD- SOFTWARE Christine 0705441545 called concerned that he was unable to see the desktop icons from this device. I took her through the procedure of cold booting the device by long pressing on the power button until the device shuts down then power it back on and she was now able to see the desktop icons. Issue resolved.", "serial_number": "GOKMOESTLDD2123010", "error_code": "LDD - SOFTWARE"}}, {"pk": 723343, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213848, "date": "2017-07-27", "report": "Teacher Miriam (720240772) called concerned to be shown on how to access internet. I advised her to load her phone with bundles then call us back. She later called back and I took her through the process of creating a hot spot from her phone then on the TDD we were able to connect the device to the phone Wi-Fi network and after connecting she was able to use the internet. Issue resolved.", "serial_number": "GOKMOESTTDD2004490", "error_code": "TDD-NETWORK"}}, {"pk": 560316, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213938, "date": "2017-07-06", "report": "Teacher Agatha 723831452 called concerned that she was unable to see the subtopics on the content on this device. I advised her to open the English content and showed her how to access that subtopics and she was able to.", "serial_number": "gokmoesttdd2004694", "error_code": "TDD-CONTENT"}}, {"pk": 585850, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213938, "date": "2017-07-06", "report": "Teacher Agatha 723831452 called concerned that the volume of this device was too low. I asked her to connect the device to the power cable and power it on. I then showed her how to add volume and she was able to.", "serial_number": "q72g705aaaaac0981", "error_code": "PROJECTOR- SOUND"}}, {"pk": 358389, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213943, "date": "2017-06-27", "report": "TDD- NETWORK Madam Jecinta 0726877568 called concerned that she was unable to connect this device to the CAP network. I took her through the procedure of connecting this device to the CAP network and she was able to.", "serial_number": "GOKMOESTtDD2004986", "error_code": "TDD-NETWORK"}}, {"pk": 968790, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213943, "date": "2017-07-03", "report": "Teacher Jacinta (726877568) called to be assisted on how to get sub-topics on the social studies class one content. I assisted her in reducing the zoom percentage to 75% and after that she was able to see the sub-topics.", "serial_number": "GOKMOESTTDD2004986", "error_code": "TDD-CONTENT"}}, {"pk": 637918, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213943, "date": "2017-07-03", "report": "Teacher Jacinta (726877568) called to be assisted on how to pause while playing content .I advised her to normally use the space bar and it was able to work.", "serial_number": "GOKMOESTTDD2004986", "error_code": "TDD-SOFTWARE"}}, {"pk": 69764400, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213964, "date": "2017-06-08", "report": "CAP NOT CHARGING Joyce-720981700 called to report this device which she said it’s not powering on. I asked her to confirm if she was using the right charger which she said she was using the TDD charger to charge the CAP. I advised her to look for the charger of the CAP and charge the CAP. Joyce promised to call back after finding the CAP charger. We later called back and teacher Joyce 0720981700 confirmed that they were using the wrong charger and that they found the right charger to charge the device and it worked well.", "serial_number": "1C497B9F1C67", "error_code": "CAP - NOT CHARGING"}}, {"pk": 231146, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213964, "date": "2017-07-14", "report": "Teacher Moses called concerned about device  unable to display the Kicd Contents.I took him through the process of search button and he was now able to locate the content thus resolved.", "serial_number": "GOKMOESTTDD2006750", "error_code": "TDD-CONTENT"}}, {"pk": 553315, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213740, "date": "2017-07-05", "report": "Madam Jemima (736155621) called to report that she was getting a no internet message when she tried connecting to the cap network. I advised her that the CAP does not provide internet but just network to connect to the devices and provide updated content. She also wanted to get assistance on how to register students on net support. I advised her to launch net support but she informed me that she could not see  students because she had changed the room name from room 1 to resource center. I advised her to delete that room and create another room and name it Room 1. I was then able to take her through the registering students process successfully. Problem solved", "serial_number": "GOKMOESTTDD2006699", "error_code": "TDD-NETSUPPORT"}}, {"pk": 131713, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213968, "date": "2017-06-30", "report": "Madam Janet 727248445  called us today in regards to this device, she wanted to know how to connect the device to the cap network. I advised the teacher to power on the cap and the ldd, then click at the notification area and choose all settings. She was able to connect the device top the cap network, which is the connect server AP. Issue resolved.", "serial_number": "gokmoestldd2119221", "error_code": "LDD-NETWORK"}}, {"pk": 622263, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213968, "date": "2017-07-11", "report": "Teacher Janet 727248445 called concerned that she was unable to use the show menu function on the net support. I took her through the procedure of connecting this device and one LDD to the CAP network and she was able to. I then advised her to launch the net support function and took her through the procedure of using and ending the show menu function and she was able to.", "serial_number": "GOKMOESTtDD2005409", "error_code": "TDD-NETSUPPORT"}}, {"pk": 75580900, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214124, "date": "2017-05-10", "report": "CONNECTION TO CAP-Teacher Elizabeth called that she could not be able to connect this device to the CAp network and i assisted her on the connection through the action center-all settings-network and internet-WiFi then content server Ap and i assisted her on accessing the content from the Cap.she also said that teacher training portal,kec,final curriculum national training,online kicd digital pages could not open and i advised her that they could open if she was connected via the internet.ISSUE RESOLVED.", "serial_number": "GOKMOESTTDD2007002", "error_code": "TDD-NETWORK"}}, {"pk": 774019, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214124, "date": "2017-06-30", "report": "PROJECTOR- CONNECTION Mr Samuel 724780232 called to inquire how a VGA cable is used on this device and the TDD. He gave the phone to Madam Elizabeth and I took her through the procedure of connecting the VGA converter and use it on the TDD and she was now able to do it.", "serial_number": "Q72G705AAAAAC1065", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 525661, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213732, "date": "2017-06-13", "report": "Madam Cecilia 723160806 called us today in regards to this device which as showing an inverted screen. I advised her to press CTRL+ALT+ARROW KEYS and adjust the screen to the correct positioning. She was able to turn the screen to the correct side. Issue Resolved.", "serial_number": "GOKMOESTTDD2005084", "error_code": "TDD - SOFTWARE"}}, {"pk": 430295, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 213998, "date": "2017-06-27", "report": "TDD- HANGING Mr Peter 0715622516 called concerned that he was unable to sign in using the teachers account on this device. I took him through the procedure of cold booting this device and he was able to see the desktop. He confirmed that the device was now working well.", "serial_number": "GOKMOESTTDD2006986", "error_code": "TDD-HANGING"}}, {"pk": 52832, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214165, "date": "2016-09-20", "report": "PROJECTOR IMAGE: Mr Rutto 0720970889 headteacher Kapmaso primary called to report that the projector was showing a blurred image i advised him to use the focus ring until he gets a clear image.and he was able to see a clear image.he also said the screen was small i advised him to move the project  from the white board and the screen was now bigger.Issue resolved.", "serial_number": "Q72G628AAAAAC0798", "error_code": "PROJECTOR-IMAGE"}}, {"pk": 580441, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214165, "date": "2016-10-24", "report": "Mr. Jethro 0726955186 quality check at Kericho county called to inquire about net support,he wanted to create a test for the pupils in readiness for their launch on Wednesday this week .He wanted to use test designer to create a test but  it requested for user name and password.I advised him to use the send and collect work function.I took him through the process and he confirmed he was able to use it well.", "serial_number": "GOKMOESTTDD2000160", "error_code": "TDD - NETSUPPORT"}}, {"pk": 792450, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214139, "date": "2016-09-28", "report": "LDD NOT PRODUCING ANY SOUND. LEONARD AN ICT OFFICER 0728096902 from Kericho called us today concerning some faulty devices he found after visiting the school yesterday, this device was not producing any sound even after adjusting the volume. He was not in school at the moment, i told him that i will call the school to troubleshoot the device.CALL BACK AT 3 PM Mr Edmond (0722275617)called to inform us this device was not producing any sound when playing a content . I advised him to power on the device on  and try  playing a content and the device was able to produce sound. I advised him to always ensure that the device is fully charged and volume is set to 100% when using the device.", "serial_number": "GOKMOESTLDD2010036", "error_code": "LDD - SOUND"}}, {"pk": 512626, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214139, "date": "2016-09-28", "report": "CAP NOT CHARGING. LEONARD AN ICT OFFICER 0728096902 from Kericho called us today concerning some faulty devices he found after visiting the school yesterday, the cap was not charging even when connected to the charger there was no light seen. I told him i will call the school to troubleshoot the device.CALL BACK AT 3PM Mr Edmond (0722275617) called to inform us that the above device was not showing any indicator that it was charging but the device was working well. I advised him to use the device while on charge.", "serial_number": "1C497B7869F3", "error_code": "CAP - NOT CHARGING"}}, {"pk": 441155, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214139, "date": "2016-09-28", "report": "LDD WAS PRODUCING A WHIZZING SOUND. LEONARD AN ICT OFFICER 0728096902 from Kericho called us today concerning some faulty devices he found after visiting the school yesterday, this device was producing a whizzing sound but he muted the volume. I told him i will call the school to confirm and troubleshoot the problem because he was not at the school at the moment. We called the teacher and took him through the powering on procedure and adjusting the volume to 100, also after clicking on the content the sound was clear. RESOLVED AT LEVEL 1", "serial_number": "GOKMOESTLDD2010100", "error_code": "LDD - SOUND"}}, {"pk": 770705, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214139, "date": "2016-09-28", "report": "LDD NOT CHARGING. LEONARD AN ICT OFFICER 0728096902 from Kericho called us today concerning some faulty devices he found after visiting the school yesterday, this device was not charging even after connecting it to the right charger and using different sockets no led light was seen. He was not in school at the moment, i told him that i will call the school to troubleshoot the device. CALL BACK AT 3 PM 28/09/2016. Teacher Edmond 0722275617 confirmed that the device was not charging yesterday and i advised him to connect the device to the right charger and he was able to see a red led light and it was almost full. I advised him to always charge the devices fully before using them. RESOLVED AT LEVEL 1 RESOLVED AT LEVEL 1", "serial_number": "GOKMOESTLDD2010064", "error_code": "LDD - NOT CHARGING"}}, {"pk": 530890, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214371, "date": "2016-11-29", "report": "TDD- SOFTWARE Teacher David 0716989889 called in regards to this device that was requesting for password when he tried using a modem to do administrative work. I advised him to request a technician who will be sent to the school to input the password so that he can be able to use a modem.", "serial_number": "GOKMOESTTDD1001693", "error_code": "TDD - SOFTWARE"}}, {"pk": 302170, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214279, "date": "2017-01-18", "report": "LDD- SOFTWARE Lennard ICT Assistant officer 0728096902 called concerned that this device was hanging and not producing sound when playing the KICD content. I advised him to cold boot the device by long pressing on the power button until it shuts down then power it back on. I advised him to increase the volume to 100% and play  a subject and the device was now working well.", "serial_number": "GOKMOESTLDD1173815", "error_code": "LDD - SOFTWARE"}}, {"pk": 357826, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214279, "date": "2017-01-19", "report": "LDD- SOUND,Lennard ICT Assistant officer (0728096902) called concerned that this device was producing a whizzing sound when playing content. I advised him to mute the device then shut it down and set it aside. I advised him to power on the device tomorrow and check if it still has a whizzing sound and call us back if problem persist. After doing an outbound call to Mr Lennard, he called the school and the teacher Mr Kigane 0715075919 called us and confirmed that the device was working properly without the whizzing sound.", "serial_number": "GOKMOESTLDD1149858", "error_code": "LDD - SOUND"}}, {"pk": 276402, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214279, "date": "2017-01-19", "report": "LDD- SOUND. Mr Lennard 0728096902 ICT Assistant officer called concerned that this device was producing a whizzing sound when playing content. I advised him to mute the device then shut it down and set it aside. I advised him to power on the device tomorrow and check if it still has a whizzing sound and call us back if problem persist. After doing an outbound call to Mr Lennard, he called the school and the teacher Mr Kigane 0715075919 called us and confirmed that the device was working properly without the whizzing sound.", "serial_number": "GOKMOESTLDD1155951", "error_code": "LDD - SOUND"}}, {"pk": 141475, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214279, "date": "2017-01-19", "report": "LDD NOT SHUTTING DOWN. Mr Kigane called us in regards to this device which was not shutting down yesterday, but after trying shutting it down today it powered off successfully and now it is working properly.", "serial_number": "GOKMOESTLDD1102743", "error_code": "LDD - SOFTWARE"}}, {"pk": 641249, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214329, "date": "2017-03-03", "report": "Mr. Maritim-722425859 Called to report this device which he explained that he was not able to log in with the Students Account because the icon was not responding. I advised him to cold reboot the device and try to log in and see if the icon will respond. After following the procedure the device responding and it is working PROBLEM SOLVED", "serial_number": "GOKMOESTLDD1111075", "error_code": "LDD - TOUCH SCREEN"}}, {"pk": 979002, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214256, "date": "2017-06-30", "report": "TDD- HANGING Teacher Rotich 0726419632 called concerned that he was unable to sign in using the teachers account on this device. I took him through the procedure of cold booting the device and he was able to sign in and access the desktop. Issue resolved.", "serial_number": "GOKMOESTtDD2003892", "error_code": "TDD-HANGING"}}, {"pk": 91558, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214408, "date": "2017-02-28", "report": "Mr Sang (0723573227) called in regards to this device that was not producing sound when connected to the projector. I advised him to power on the TDD and the projector then firmly connect the HDMI cable to both the TDD and projector and it produced sound. I advised him to always ensure that he firmly connects the HDMI cable to both the TDD and projector. Problem solved.", "serial_number": "Q72G644AAAAAC0250", "error_code": "PROJECTOR- SOUND"}}, {"pk": 850201, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214408, "date": "2017-05-17", "report": "TDD HANGING Mr. Cosmos called to report this device which he explained he could not log in to the Teacher’s account. I advised him to cold reboot the device and on powering it on the device responded and he was able to log in. PROBLEM SOLVED", "serial_number": "GOKMOESTTDD2001637", "error_code": "TDD - HANGING"}}, {"pk": 468847, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214200, "date": "2017-03-24", "report": "TDD- NET SUPPORT Mr Kirui 0707263456 called concerned that he was unable to see the connected student through the net support. He confirmed that the TDD and the LDD are both connected to the CAP network. I then advised him to launch the net support then click on Manage class and refresh and he was able to view the student from the net support.  problem solved.", "serial_number": "GOKMOESTTDD2005323", "error_code": "TDD - NETSUPPORT"}}, {"pk": 329507, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214200, "date": "2017-05-09", "report": "LDD NOT RESPONDING TO TOUCHrnTeacher Kiruii called to in regards to this device which was not responding to touch, i advised him to cold boot the device and he was able to navigate through the device after it finished powering on. He was also concerned that he could not fill in the answers on the social study class 2 questions, since the device was not responding to touch. I advised him to connect the device to the cap network and click on the connect server AP to get the updated content from the cap and he was able to see the content but he asked for more time to search for the question he was handling before.On calling him back,e affirmed that he was able to go through the process thus issue resolved", "serial_number": "gokmoestldd2133946", "error_code": "LDD - TOUCH SCREEN"}}, {"pk": 862604, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214238, "date": "2017-04-03", "report": "LDD- WHIZZING SOUND Mr Weldon 0774404555 called concerned that this device was producing a whizzing sound when he tried playing a content. He then handed the phone to Mr Alex and I took him through the procedure of cold booting the device until it shuts down then I advised him to power it back on. I then advised him to play a content and it worked. Problem solved", "serial_number": "GOKMOESTLDD2091075", "error_code": "LDD - SOUND"}}, {"pk": 646677, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214238, "date": "2017-04-03", "report": "LDD- WHIZZING SOUND Mr Weldon 0774404555 called concerned that this device was producing a whizzing sound when he tried playing a content. He then handed the phone to Mr Alex and I took him through the procedure of cold booting the device until it shuts down then I advised him to power it back on. I then advised him to play a content and it worked. Problem solved", "serial_number": "GOKMOESTLDD2110931", "error_code": "LDD - SOUND"}}, {"pk": 347389, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214238, "date": "2017-04-03", "report": "LDD- WHIZZING SOUND Mr Weldon 0774404555 called concerned that this device was producing a whizzing sound when he tried playing a content. He then handed the phone to Mr Alex and I took him through the procedure of cold booting the device by long pressing on the power button until it shuts down then I advised him to power it back on. I then advised him to play a content from the desktop but it could not fully load. I advised him to connect the device to the CAP network and play content from the content server AP and he was able to. Problem solved", "serial_number": "GOKMOESTLDD2111480", "error_code": "LDD - SOUND"}}, {"pk": 136817, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214238, "date": "2017-04-03", "report": "LDD- SOFTWARE Mr Alex 0774404555 called concerned that this device did not have icons when he pressed on the start window. I advised him to cold boot the device by long pressing on the power button until it shuts down then power it back on. I then advised him to press on the start window and he could now see the icons, Problem solved", "serial_number": "GOKMOESTLDD2086560", "error_code": "LDD - SOFTWARE"}}, {"pk": 992590, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214398, "date": "2017-03-14", "report": "LDD SEND AND COLLECT WORK. Mr Joseph 713803884 called us today, he wanted to send work to the student, I took him through the cap connection on both the TDD and ldd and after that he launched the net support and he was able to see the send and collect function and he was able to send work to the student. Issue resolved.", "serial_number": "gokmoestldd2043875", "error_code": "LDD-NETSUPPORT"}}, {"pk": 531592, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214403, "date": "2017-05-22", "report": "Teacher Irine called concerned about the device not displaying the TDD's content.I took her through the source selection using the source button thus the projector was abe to display.", "serial_number": "Q72G647AAAAAC0927", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 600026, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214403, "date": "2017-05-22", "report": "Teacher Irine (0722318788) called concerned to be shown how to connect this device to the CAP.I took her through the process of connection and confirmed this by viewing a yellow triangle and an exclamation mark on it thus resolved.", "serial_number": "GOKMOESTTDD2005065", "error_code": "TDD-NETWORK"}}, {"pk": 325562, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214403, "date": "2017-05-22", "report": "Teacher Irine (0722318788) called concerned to be shown how to connect this device to the CAP.I took her through the process of connection and confirmed this by viewing a yellow triangle and an exclamation mark on it thus resolved.", "serial_number": "GOKMOESTLDD2125560", "error_code": "LDD-NETWORK"}}, {"pk": 851471, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214448, "date": "2017-06-19", "report": "Teacher Jenipher (0724885605) called concerned about this device not responding to teachers sign in.I took her through the process of cold booting and  the device responded thus resolved.", "serial_number": "GOKMOESTTDD2005473", "error_code": "TDD-HANGING"}}, {"pk": 851471, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214448, "date": "2017-06-19", "report": "Teacher Jenipher (0724885605) called concerned about this device not responding to teachers sign in.I took her through the process of cold booting and  the device responded thus resolved.", "serial_number": "GOKMOESTTDD2005473", "error_code": "TDD-HANGING"}}, {"pk": 535308, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214315, "date": "2017-06-09", "report": "PROJECTOR- DISPLAY Teacher Lelei (0726267916) called concerned about this device displaying an inverted image.As i was taking him through the correction process,the call disconnected. Mr Lelei (0726267916) later called back and confirmed that the projection is upright but he wanted to enlarge the projection image. I advised him to push the projector further from the white surface and he was able to see larger projections. Issue resolved", "serial_number": "Q72G705AAAAAC0806", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 578728, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214328, "date": "2017-06-12", "report": "LDD- AUTOMATIC REPAIR.  Madam Florence 0723527970 called concerned that this device displayed automatic repair error when she powered it on. I advised her to cold boot the device by long pressing on the power button until the device powered off then power it back on. She confirmed that she could now see the desk top. Issue resolved.", "serial_number": "GOKMOESTLDD2183176", "error_code": "LDD - IMAGE"}}, {"pk": 979656, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214328, "date": "2017-06-12", "report": "LDD- AUTOMATIC REPAIR.  Madam Florence 0723527970 called concerned that this device displayed automatic repair error when she powered it on. I advised her to cold boot the device by long pressing on the power button until the device powered off then power it back on. She confirmed that she could now see the desk top and that the device was now working well. Issue resolved.", "serial_number": "GOKMOESTLDD2151290", "error_code": "LDD - IMAGE"}}, {"pk": 958858, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214328, "date": "2017-06-12", "report": "LDD- AUTOMATIC REPAIR.  Madam Florence 0723527970 called concerned that this device displayed automatic repair error when she powered it on. I advised her to cold boot the device by long pressing on the power button until the device powered off then power it back on. She confirmed that she could now see the desk top and that the device was now working well. Issue resolved.", "serial_number": "GOKMOESTLDD2192052", "error_code": "LDD - IMAGE"}}, {"pk": 477759, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214328, "date": "2017-06-12", "report": "LDD- AUTOMATIC REPAIR.  Madam Florence 0723527970 called concerned that this device displayed automatic repair error when she powered it on. I advised her to cold boot the device by long pressing on the power button until the device powered off then power it back on. She confirmed that she could now see the desk top and that the device was now working well. Issue resolved.", "serial_number": "GOKMOESTLDD2181533", "error_code": "LDD - IMAGE"}}, {"pk": 25038, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214328, "date": "2017-07-06", "report": "Mr Nicolas 729679401 called concerned that he was unable to connect this device and GOKMOESTTDD2013778 to the CAP network and also use the net support register and show menu function. I took him through the procedure of connecting both devices and LDD Gokmoestldd2191394 to the CAP network. I then took him through the procedure of launching the net support creating a room and registering the students.", "serial_number": "Gokmoesttdd2013784", "error_code": "TDD-NETSUPPORT"}}, {"pk": 272250, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214277, "date": "2017-07-17", "report": "Mr Mosses (700439420) a com21 technician called today to inform us that he was doing installation in the school and identified that this device was producing some funny noise. He compared the noise to a fun noise that was on and off. I advised him to update the sound drivers but he assured me that it was not the sound drivers that had an issue. I requested him to just try updating the drivers then call us back with the feedback. On calling him back he confirmed the device is ok  thus issue resolved.", "serial_number": "GOKMOESTLDD2138342", "error_code": "LDD-DOA-SOUND"}}, {"pk": 661372, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214277, "date": "2017-07-17", "report": "Mr Mosses (700439420) a com21 technician called to inform us that he was doing installation in the school and identified that the windows icon (startup button) in this device was not responding to touch. He confirmed that all the other icons were responding to touch apart from that one. I advised him to connect the device to the internet then reboot it (as advised by the technical lead) and then call us back with the feedback. On calling him back ,he confirmed that the device is now ok thus resolved.", "serial_number": "GOKMOESTLDD2179038", "error_code": "LDD-DOA-SOFTWARE"}}, {"pk": 974440, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214413, "date": "2017-07-03", "report": "TDD- HANGING Teacher Albert 0720443595 called concerned that he was unable to sign in using using the teachers account. I took him through the procedure of cold booting the device and he was able to see the desktop icons and open the a content.", "serial_number": "GOKMOESTtDD2011609", "error_code": "TDD-HANGING"}}, {"pk": 740974, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214416, "date": "2017-06-21", "report": "LDD- AUTOMATIC REPAIR Madam Eglah 0720443595 called concerned that this device had displayed AUTOMATIC REPAIR on the desktop when she powered it on. I advised her to cold boot the device by long pressing on the power button to shut the device down then power it back on. She confirmed that she could see the desktop and that the device was now working well. Issue resolved.", "serial_number": "GOKMOESTLDd2172818", "error_code": "LDD-IMAGE"}}, {"pk": 728614, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214474, "date": "2017-06-07", "report": "Teacher Dennis(721370580)called concerned that when he tried to connect this device to the CAP network and he was concerned that it was giving him a \"no internet\" message,i took him through the connection procedure and he was able to connect this device and it showed him a yellow triangle with an exclamation mark.i then advised him that the CAP only provides network and he can only access the content and not the internet.ISSUE RESOLVED.", "serial_number": "gokmoesttdd2014076", "error_code": "TDD-NETWORK"}}, {"pk": 775924, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214341, "date": "2017-03-03", "report": "TOUCH NOT RESPONDING Mr. Langat from Chebirir Primary School in Kericho County called to report this device which he explained is not responding to touch. I advised him to cold reboot the device and power them on. After the procedure the device responded.PROBLEM SOLVED", "serial_number": "GOKMOESTLDD2096777", "error_code": "LDD - TOUCH SCREEN"}}, {"pk": 862971, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214341, "date": "2017-03-03", "report": "LDD TOUCH NOT RESPONDING Mr. Langat from Chebirir Primary School in Kericho County called to report this device which he explained is not responding to touch. I advised him to cold reboot the device and power them on. After the procedure the device responded.PROBLEM SOLVED", "serial_number": "GOKMOESTLDD2120276", "error_code": "LDD - TOUCH SCREEN"}}, {"pk": 156049, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214341, "date": "2017-03-06", "report": "Mr. Langat 0727711545 from Chebirir Primary School in Kericho County called to report this device which he explained is not responding to touch. I advised him to cold reboot the device and power them on. The call disconnected before he could give a feedback. We made an outbound call today and the teacher confirmed that the device responded to touch after cold rebooting the device. Issue resolved.", "serial_number": "GOKMOESTLDD2099259", "error_code": "LDD - TOUCH SCREEN"}}, {"pk": 771138, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214341, "date": "2017-03-14", "report": "GOKMOESTTDD2001312 NETSUPPORT NAVIGATION Mr.Langat -727711545 called to be assisted with Net support student registration. I was able to assist him by advising him first to connect this device to the CAP Network then on Net support click on student register. I then asked him to select the fields that he wanted the students to fill then click on register to prompt the student to register .After following the procedure he was successful  Problem Solved", "serial_number": "GOKMOESTTDD2002757", "error_code": "TDD - NETSUPPORT"}}, {"pk": 342271, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 214477, "date": "2017-09-12", "report": "Mr. Leonard 739406276 the Icta officer of Kericho county, he called in regards to this  device which was not giving the correct commands, like when he was typing the letter U it was giving him number 4. I advised him to press fn and Num lock simultaneously, and the device worked properly. Issue resolved", "serial_number": "GOKMOESTTDD2011671", "error_code": "TDD-SOFTWARE"}}, {"pk": 530670, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208203, "date": "2017-03-08", "report": "LDD- WHIZZING SOUND Madam Florence 0723459858 called in regards to this device which was producing a whizzing sound when she tried playing a content. I advised her to cold boot the device by long pressing on the power button until it shuts down then power it back on. I advised her to play a content and the device was now working well.", "serial_number": "GOKMOESTLDD2020279", "error_code": "LDD - SOUND"}}, {"pk": 816727, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208203, "date": "2017-03-09", "report": "LDD- NOT POWERING ON Madam Florence 0723459858 called concerned that this device is not powering on even after charging for 2 hours. I advised her to connect the charger to the device and it indicated a red LED light. I advised her to long press on the power button for some seconds and the device powered on. I advised her to ensure that she charges the device well before use.", "serial_number": "GOKMOESTLDD2016079", "error_code": "LDD - NOT POWERING ON"}}, {"pk": 905640, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207707, "date": "2017-07-11", "report": "Madam Maryanne 720378367 called us today in regards to this device which was not displaying on the white board. I advised the teacher to connect the HDMI cable to the projector and firm the connection, she was able to see the image on the TDD displayed on the white board. Issue resolved.", "serial_number": "q72g646aaaaac0770", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 307627, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207707, "date": "2017-07-11", "report": "Teacher Maina called concerned to be shown how to connect to the CAP network.I took him through the process of connection and he was able to connect the devices to the CAP network thus resolved..", "serial_number": "GOKMOESTTDD2009079", "error_code": "TDD-NETWORK"}}, {"pk": 859449, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207707, "date": "2017-07-11", "report": "Teacher Maina called concerned to be shown how to connect  this device to the CAP network.I took him through the process of connection and he was able to connect the devices to the CAP network thus issue solved .", "serial_number": "GOKMOESTLDD2163707", "error_code": "LDD-NETWORK"}}, {"pk": 610942, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208553, "date": "2017-07-12", "report": "Teacher Ester 716019319 called concerned that she was unable to sign in using the students account on this device. I took her through the cold booting procedure and she could see the desktop. She confirmed that this device was now working well.", "serial_number": "gokmoestldd2103810", "error_code": "LDD-TOUCH-SCREEN"}}, {"pk": 250318, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208553, "date": "2017-07-12", "report": "Teacher Esther (716019319) called concerned about unable to follow up on the Kiswahili content for class one.I took her through the process of accessing the content and its subtopics thus resolved.", "serial_number": "GOKMOESTTDD2008644", "error_code": "TDD-CONTENT"}}, {"pk": 448763, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208553, "date": "2017-07-12", "report": "Teacher Ester 716019319 called concerned that the net support of this device was not working well. I advised her to power on the device but it could not power on. I then advised her to connect the device to a working charger and she could see a red LED light. I advised her to let the device charge for sometime and call us back so that we can troubleshoot.She called back and the device was now powering on on cold booting the device was now responding to netsupport.", "serial_number": "GOKMOESTTDD2008535", "error_code": "TDD-NETSUPPORT"}}, {"pk": 112238, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208261, "date": "2017-07-13", "report": "Mr John 724990513 called concerned that he was unable to connect this device ti the TDD using the HDMI cable. He said that when he tried connecting this device to the HDMI cable the TDD powered off. I advised him to power on the projector and connect the HDMI cable to this device and the TDD and he was able see the projection.", "serial_number": "q72g646aaaaac0079", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 112238, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208261, "date": "2017-07-13", "report": "Mr John 724990513 called concerned that he was unable to connect this device ti the TDD using the HDMI cable. He said that when he tried connecting this device to the HDMI cable the TDD powered off. I advised him to power on the projector and connect the HDMI cable to this device and the TDD and he was able see the projection.", "serial_number": "q72g646aaaaac0079", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 677954, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208533, "date": "2017-07-04", "report": "Madam Catherine 723726107 called us today in regards to this device which she wanted to connect to the cap network. I advised her to power on the cap then on the TDD side she should click the notification area and choose all setting. I advised her to click the the connect server AP then connect, after a while the device connected to the cap network. Issue resolved.", "serial_number": "gokmoesttdd2011842", "error_code": "TDD-NETWORK"}}, {"pk": 69956, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208390, "date": "2017-07-12", "report": "LDD-AUTOMATIC RESTART Madam Milka 711673612 called concerned that this device had error 'automatic repair restart your PC' when she powered on this device. I advised her to cold boot the device and she was able to see the desktop icons. She confirmed that the device was now working well.", "serial_number": "gokmoestldd2103846", "error_code": "LDD-IMAGE"}}, {"pk": 643560, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208390, "date": "2017-07-13", "report": "resolved", "serial_number": "GOKMOESTLDD2103846", "error_code": "LDD-IMAGE"}}, {"pk": 248902, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208596, "date": "2017-07-06", "report": "Mr Githua 721787467 called concerned that he was unable to view the connected students from the net support. I took him through the procedure of connecting the TDD and one LDD to the CAP network and he was able to. I then advised him launch the net support and he was able to see the connected devices. Issue resolved.", "serial_number": "GOKMOESTtDD2007429", "error_code": "TDD-NETSUPPORT"}}, {"pk": 876890, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208354, "date": "2017-07-17", "report": "LDD- AUTOMATIC REPAIR  Madam Pamela 733266038 called concerned that this device had error 'automatic repair restart your PC' when she powered on the device. I advised her to power on the device and took her through the trouble shooting procedure and it worked.", "serial_number": "gokmoestldd2163528", "error_code": "LDD-IMAGE"}}, {"pk": 533135, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208354, "date": "2017-07-17", "report": "LDD- AUTOMATIC REPAIR Madam Pamela 733266038 called concerned that this device had error 'automatic repair restart your PC' when she powered on the device. I advised her to power on the device and she could still see the error. I then took her through the cold booting procedure and it worked.", "serial_number": "gokmoestldd2110339", "error_code": "LDD-IMAGE"}}, {"pk": 207133, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208354, "date": "2017-07-21", "report": "LDD- AUTOMATIC REPAIR rnMadam Pamela 733266038 called concerned that this device had error 'automatic repair restart your PC' when she powered on the device. I advised her to power on the device but it could not power on. I advised her to charge the device then call us back.She called us back to confirm that the device is now working well thus resolved.", "serial_number": "gokmoestldd2169627", "error_code": "LDD-IMAGE"}}, {"pk": 161213, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208354, "date": "2017-07-21", "report": "LDD- AUTOMATIC REPAIR rnMadam Pamela 733266038 called concerned that this device had error 'automatic repair restart your PC' when she powered on the device. I advised her to power on the device but it could not power on. I advised her to charge the device then call us back.She called us back to confirm that the device is now working well thus resolved.", "serial_number": "gokmoestldd2168731", "error_code": "LDD-IMAGE"}}, {"pk": 285625, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208354, "date": "2017-07-21", "report": "LDD- AUTOMATIC REPAIR rnMadam Pamela 733266038 called concerned that this device had error 'automatic repair restart your PC' when she powered on the device. I advised her to power on the device but it could not power on. I advised her to charge the device then call us back.She called us back to confirm that the device is now working well thus resolved.", "serial_number": "gokmoestldd2122661", "error_code": "LDD-IMAGE"}}, {"pk": 621861, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208393, "date": "2017-07-17", "report": "Teacher  Mwangi (0722910798) called concerned  to be shown on on how to connect this device to the Cap network.I took him through the process and even took him the the netsupport functions thus issue resolved.", "serial_number": "GOKMOESTTDD2008628", "error_code": "TDD-NETWORK"}}, {"pk": 350502, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208393, "date": "2017-07-17", "report": "Teacher  Mwangi (0722910798) called concerned  to be shown on on how to connect this device to the Cap network.I took him through the process and even took him the the netsupport functions thus issue resolved.", "serial_number": "GOKMOESTLDD2153253", "error_code": "LDD-NETWORK"}}, {"pk": 820425, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208552, "date": "2017-04-10", "report": "TDD-HANGING Madam Grace  0720778979 called concerned that she was unable to sign in with the teachers account on this device. I advised her to long press on the power button until the device shuts down then power it back on and she was able to sign in and see the desktop icons. Problem solved", "serial_number": "GOKMOESTTDD2013355", "error_code": "TDD - HANGING"}}, {"pk": 320956, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208552, "date": "2017-04-10", "report": "TDD- NETWORK Madam Grace 720778979 called concerned that this device was not connecting to the internet. She confirmed that this device had a yellow triangle on the WIFI icon. I assured her that the device is already connected to the WIFI provided by the CAP and that the CAP only provides network but not internet.", "serial_number": "GOKMOESTTDD2012999", "error_code": "TDD-NETWORK"}}, {"pk": 404445, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208448, "date": "2017-07-20", "report": "Teacher Abraham (720829806)called concerned about to be taken through the process of registration.I first took him through the process setting room mode then registering the student thus resolved.\"", "serial_number": "GOKMOESTTDD2009291", "error_code": "TDD-NETSUPPORT"}}, {"pk": 586869, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208143, "date": "2017-09-12", "report": "Mr. Henry 729288437 called in regards to this TDD which he was trying to use the net support to register the student.I took him through the connection process and  we were able to connect the tdd to the cap network  and the ldd then launched the net support and registered the student. Issue Resolved", "serial_number": "gokmoesttdd2016142", "error_code": "TDD-NETSUPPORT"}}, {"pk": 621861, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208582, "date": "2017-07-17", "report": "Teacher  Mwangi (0722910798) called concerned  to be shown on on how to connect this device to the Cap network.I took him through the process and even took him the the netsupport functions thus issue resolved.", "serial_number": "GOKMOESTTDD2008628", "error_code": "TDD-NETWORK"}}, {"pk": 350502, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208582, "date": "2017-07-17", "report": "Teacher  Mwangi (0722910798) called concerned  to be shown on on how to connect this device to the Cap network.I took him through the process and even took him the the netsupport functions thus issue resolved.", "serial_number": "GOKMOESTLDD2153253", "error_code": "LDD-NETWORK"}}, {"pk": 256970, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207489, "date": "2016-10-21", "report": "Teacher Katheri 0732611164 called to inform us that this device could not display any icon on the screen. I advised him reboot the device by long pressing on the power button and then power it back on. He said that when he powered on the device it gave him an option of repairing the PC or restating the PC. I advised him to shut down the device and set it aside a technician will be sent to the school. I advised him to use the other TDD.The teacher called again to inform us that the device was now displaying the icons thus resolved at LEVEL 1", "serial_number": "GOKMOESTtDD1001357", "error_code": "TDD - SOFTWARE"}}, {"pk": 562140, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207489, "date": "2017-02-07", "report": "TDD- DATE AND TIME SETTINGS Mr John ICT Assistant 0710446504 called in regards to this TDD which was requesting for administrator password when he tried to change the date and time. I advised him to be patient a technician will be sent to the school.", "serial_number": "GOKMOESTTDD1001357", "error_code": "TDD - SOFTWARE"}}, {"pk": 361205, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207530, "date": "2017-03-22", "report": "TDD NET SUPPORT ACTIVATION  Mr. Martin- 700074395 from Ngiriambu  in Kirinyanga County called to be assisted with Net support activation.I was able to assist him to activate the net support PROBLEM SOLVED", "serial_number": "GOKMOESTTDD2000522", "error_code": "TDD-NETSUPPORT ACTIVATION"}}, {"pk": 34001, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207530, "date": "2017-04-04", "report": "TDD NET SUPPORT NAVIGATION  Martin- 700074395 from Ngiriambu  School in Muranga County called to be assisted on how he can register students on Net support. I was able to take him through the procedure by registering one LDD and advising him to follow the same procedure to register the rest of the LDDs and then call us after he has finished then we will be able to assist him on other functions on Net support", "serial_number": "GOKMOESTTDD2000885", "error_code": "TDD - NETSUPPORT"}}, {"pk": 177508, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207530, "date": "2017-05-23", "report": "Teacher Martin (720471487) called to be assisted on how to connect this device to the CAP network and net support. I assisted him on how to connect the device to the CAP network and then asked him to launch net support. I asked him to select register student on the tool bar which he confirmed to be inactive. He confirmed to me that there were no LDDs (2019953, 2015123) visible on net support. He also confirmed that the LDDs were connected to the CAP network and still he could not see them on net support. I advised him to reboot the device, which he did and then requested to call after a few minutes because he was using his phone.  Mr. Martin- 700074395 called back to be assisted on how to connect this device to the CAP Network. I advised him to click on action centre, all setting, Network and Internet then connect to the CAP Network. Mr. Martin confirmed he could not see the CAP Network. We tried the same connection procedure to other devices but still he could not see the CAP Network. Mr. Martin confirmed that the CAP was connected to the right changer and it was blinking blue. I advised him that a technician will be sent because it seems the CAP has an issue therefore this device is working well", "serial_number": "GOKMOESTTDD2000522", "error_code": "TDD - NETSUPPORT"}}, {"pk": 246647, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207530, "date": "2017-06-05", "report": "Teacher Martin (0700074395) called to be shown on how to connect this device to his phone's portable wifi.As I was taking him through he requested to call us back since he was uneasy using the same phone. Mr. Martin called back and I was able to take him through the process of getting the security code from his phone because he wanted to use the hot spot to connect to the TDD. He confirmed the network icon to have white waves but still the network was slow. I advised him to try and use another phone to see if the Network will respond as fast as he could wish", "serial_number": "GOKMOESTTDD2000522", "error_code": "TDD-NETWORK"}}, {"pk": 485544, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207534, "date": "2017-05-17", "report": "TDD- NET SUPPORT Munene 0721324150  called concerned that they did not know how to register students. He then gave the phone to Madam Elizabeth and I took her through the procedure of connecting this device and one LDD GOKMOESTLDD2059659 to the CAP network and she was able to. I then advised her to launch the Net support and click on student register and prompt student to register and it worked. Issue resolved.", "serial_number": "GOKMOESTTDD2005948", "error_code": "TDD - NETSUPPORT"}}, {"pk": 595439, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207534, "date": "2017-06-08", "report": "PROJECTOR- CONNECTION Madam Elizabeth 0721324150 called concerned that she could not see a projection when she connected the HDMI cable to the TDD and Projector. I advised her to firmly connect the cable to both the TDD and projector then select source but she said that she was unable to see anything on the projection. I advised her to remove the HDMI cable and connect it again to the TDD and Projector and she could still not see the projection. She said that she will repeat the procedure using the VGA cable and another TDD the call us back in case she will be unable to do the connection. We later called back and Mr Munene 0721324150 confirmed that they were able to connect the TDD with the projection and see projection. The device was working well.", "serial_number": "Q72G646AAAAAC0312", "error_code": "PROJECTOR CONNECTION"}}, {"pk": 381218, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207598, "date": "2017-05-24", "report": "Mr Nyagah called 723846360 in regards to this device which was displaying the icons vertically, I advised him to click on the notification area and click on the rotation lock which was on and then since the task bar was on the right side, I advised him to click on the task bar at an empty place and make sure the lock task bar has a tick then drag the task bar at the bottom. The device worked properly, issue resolved", "serial_number": "gokmoestldd2047427", "error_code": "LDD - SOFTWARE"}}, {"pk": 785235, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207598, "date": "2017-05-24", "report": "Mr Nyagah called 723846360 in regards to this device which was not powering on, I advised him to connect the device to a working cable and after connecting he was able to see a blue led light, I told him to power on the device and after a while the device powered on and worked properly. Issue Resolved", "serial_number": "GOKMOESTLDD2107421", "error_code": "LDD - NOT POWERING ON"}}, {"pk": 913028, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207598, "date": "2017-05-24", "report": "LDD- TABLET MODE Mr Nyagah called 723846360 in regards to this device which was not seeing the desk top icons, I advised him to click the notification area and click the tablet mode which was activated, after that he was able to see the desktop icons and the device worked properly. Issue resolved.", "serial_number": "gokmoestldd2136237", "error_code": "LDD - SOFTWARE"}}, {"pk": 657503, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207598, "date": "2017-06-06", "report": "Teacher Marclus (0771038373) concerned about this device that was hanging and could not respond to clicks.I took him through the process of cold booting thus the device was now responding to clicks thus resolved.", "serial_number": "GOKMOESTTDD2005687", "error_code": "TDD - HANGING"}}, {"pk": 840938, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207471, "date": "2017-06-28", "report": "Mr John 736103371 an Icta officer of kirinyaga county called us today in regards to this device which was not displaying the cable connected. I advised him to connect the HDMI cable and choose it as the source and he was able to see the projection on the white board. Issue resolved.", "serial_number": "q72g646aaaaac0453", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 904748, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207588, "date": "2017-07-10", "report": "Mr Bernard 721783597  called from concerned that this device was hanging. I advised him to cold boot the device by long pressing on the power button for some seconds then power it back on. I then advised him to try opening a content and it worked. Issue resolved.", "serial_number": "GOKMOESTTDD2008648", "error_code": "TDD-HANGING"}}, {"pk": 904748, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207588, "date": "2017-07-10", "report": "Mr Bernard 721783597  called from concerned that this device was hanging. I advised him to cold boot the device by long pressing on the power button for some seconds then power it back on. I then advised him to try opening a content and it worked. Issue resolved.", "serial_number": "GOKMOESTTDD2008648", "error_code": "TDD-HANGING"}}, {"pk": 904748, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207588, "date": "2017-07-10", "report": "Mr Bernard 721783597  called from concerned that this device was hanging. I advised him to cold boot the device by long pressing on the power button for some seconds then power it back on. I then advised him to try opening a content and it worked. Issue resolved.", "serial_number": "GOKMOESTTDD2008648", "error_code": "TDD-HANGING"}}, {"pk": 904748, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207588, "date": "2017-07-10", "report": "Mr Bernard 721783597  called from concerned that this device was hanging. I advised him to cold boot the device by long pressing on the power button for some seconds then power it back on. I then advised him to try opening a content and it worked. Issue resolved.", "serial_number": "GOKMOESTTDD2008648", "error_code": "TDD-HANGING"}}, {"pk": 904748, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207588, "date": "2017-07-10", "report": "Mr Bernard 721783597  called from concerned that this device was hanging. I advised him to cold boot the device by long pressing on the power button for some seconds then power it back on. I then advised him to try opening a content and it worked. Issue resolved.", "serial_number": "GOKMOESTTDD2008648", "error_code": "TDD-HANGING"}}, {"pk": 904748, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207588, "date": "2017-07-10", "report": "Mr Bernard 721783597  called from concerned that this device was hanging. I advised him to cold boot the device by long pressing on the power button for some seconds then power it back on. I then advised him to try opening a content and it worked. Issue resolved.", "serial_number": "GOKMOESTTDD2008648", "error_code": "TDD-HANGING"}}, {"pk": 637114, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212247, "date": "2016-09-20", "report": "Mr King'ori 0722937154 from Doldol called to report on this device that he was not able to see the desktop icons I advised the teacher to long press on the desktop tap on view then choose show desktop icons and he was now able to see the desktop icons.issue resolved.", "serial_number": "GOKMOESTLDD2007468", "error_code": "LDD - SOFTWARE"}}, {"pk": 438697, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212272, "date": "2017-07-11", "report": "Teacher  Grace (722482661) called concerned about this device displaying solid red on the lamp light and powering on  then immediately going off.I advised her to set the device aside and a technician would be sent to the school to work on it.", "serial_number": "WD4K6700932", "error_code": "PROJECTOR-LAMP"}}, {"pk": 670100, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212272, "date": "2017-07-11", "report": "Teacher Grace (727803942) called concerned about this device hanging when a content is opened.I advised her to cold boot and the device was now working properly thus solved.", "serial_number": "GOKMOESTTDD1001413", "error_code": "TDD-HANGING"}}, {"pk": 74904, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212272, "date": "2017-07-11", "report": "Madam Grace 727803942 called us today concerned that she could not see the student on the net support. I advised her to confirm the connection of the cap network, she confirmed she could see the yellow triangle. I told her to launch the net support and she could not see the connected student so we removed the room and created a new one and she could now see the connected student issue resolved.", "serial_number": "GOKMOESTTDD1001393", "error_code": "TDD-NETSUPPORT"}}, {"pk": 270237, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212272, "date": "2017-07-11", "report": "Madam Grace 727803942 called us today concerned that she could see and error message of auto repair, I advised her to cold reboot the device and after powering on the device the device worked properly and she could navigate through the device properly. Issue resolved.", "serial_number": "gokmoestLDD1177749", "error_code": "LDD-IMAGE"}}, {"pk": 514254, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212272, "date": "2017-09-11", "report": "Madam Grace called 0727803942 in regards to this device which she was trying to send work to the connected ldd but the work was not being sent to the student’s devices. I advised the teacher to confirm that the devices were connected then i took her through the net support send and collect, she was able to choose work from the desktop and send it to the student. Issue resolved.", "serial_number": "gokmoestTDD1001393", "error_code": "TDD-NETSUPPORT"}}, {"pk": 438697, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212272, "date": "2017-07-11", "report": "Teacher  Grace (722482661) called concerned about this device displaying solid red on the lamp light and powering on  then immediately going off.I advised her to set the device aside and a technician would be sent to the school to work on it.", "serial_number": "WD4K6700932", "error_code": "PROJECTOR-LAMP"}}, {"pk": 670100, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212272, "date": "2017-07-11", "report": "Teacher Grace (727803942) called concerned about this device hanging when a content is opened.I advised her to cold boot and the device was now working properly thus solved.", "serial_number": "GOKMOESTTDD1001413", "error_code": "TDD-HANGING"}}, {"pk": 74904, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212272, "date": "2017-07-11", "report": "Madam Grace 727803942 called us today concerned that she could not see the student on the net support. I advised her to confirm the connection of the cap network, she confirmed she could see the yellow triangle. I told her to launch the net support and she could not see the connected student so we removed the room and created a new one and she could now see the connected student issue resolved.", "serial_number": "GOKMOESTTDD1001393", "error_code": "TDD-NETSUPPORT"}}, {"pk": 270237, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212272, "date": "2017-07-11", "report": "Madam Grace 727803942 called us today concerned that she could see and error message of auto repair, I advised her to cold reboot the device and after powering on the device the device worked properly and she could navigate through the device properly. Issue resolved.", "serial_number": "gokmoestLDD1177749", "error_code": "LDD-IMAGE"}}, {"pk": 514254, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212272, "date": "2017-09-11", "report": "Madam Grace called 0727803942 in regards to this device which she was trying to send work to the connected ldd but the work was not being sent to the student’s devices. I advised the teacher to confirm that the devices were connected then i took her through the net support send and collect, she was able to choose work from the desktop and send it to the student. Issue resolved.", "serial_number": "gokmoestTDD1001393", "error_code": "TDD-NETSUPPORT"}}, {"pk": 438697, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212272, "date": "2017-07-11", "report": "Teacher  Grace (722482661) called concerned about this device displaying solid red on the lamp light and powering on  then immediately going off.I advised her to set the device aside and a technician would be sent to the school to work on it.", "serial_number": "WD4K6700932", "error_code": "PROJECTOR-LAMP"}}, {"pk": 670100, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212272, "date": "2017-07-11", "report": "Teacher Grace (727803942) called concerned about this device hanging when a content is opened.I advised her to cold boot and the device was now working properly thus solved.", "serial_number": "GOKMOESTTDD1001413", "error_code": "TDD-HANGING"}}, {"pk": 74904, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212272, "date": "2017-07-11", "report": "Madam Grace 727803942 called us today concerned that she could not see the student on the net support. I advised her to confirm the connection of the cap network, she confirmed she could see the yellow triangle. I told her to launch the net support and she could not see the connected student so we removed the room and created a new one and she could now see the connected student issue resolved.", "serial_number": "GOKMOESTTDD1001393", "error_code": "TDD-NETSUPPORT"}}, {"pk": 270237, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212272, "date": "2017-07-11", "report": "Madam Grace 727803942 called us today concerned that she could see and error message of auto repair, I advised her to cold reboot the device and after powering on the device the device worked properly and she could navigate through the device properly. Issue resolved.", "serial_number": "gokmoestLDD1177749", "error_code": "LDD-IMAGE"}}, {"pk": 514254, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212272, "date": "2017-09-11", "report": "Madam Grace called 0727803942 in regards to this device which she was trying to send work to the connected ldd but the work was not being sent to the student’s devices. I advised the teacher to confirm that the devices were connected then i took her through the net support send and collect, she was able to choose work from the desktop and send it to the student. Issue resolved.", "serial_number": "gokmoestTDD1001393", "error_code": "TDD-NETSUPPORT"}}, {"pk": 806027, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212348, "date": "2017-06-13", "report": "Teacher Veronicah (0724269142) called concerned about this device not having desktop icon.On probing ,i realized this device was on tablet mode thus took him through the process of deactivating the tablet mode thus issue solved.", "serial_number": "GOKMOESTLDD1177702", "error_code": "LDD-SOFTWARE"}}, {"pk": 764086, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212348, "date": "2017-06-13", "report": "Teacher Veronicah (0724269142) called concerned about this device not producing sound while a content is being played.I took her through the process of adjusting the volume using the volume buttons at the back of the device thus issue resolved.", "serial_number": "GOKMOESTLDD1179524", "error_code": "LDD-SOUND"}}, {"pk": 930244, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212348, "date": "2017-06-27", "report": "Resolved by Technical lead", "serial_number": "GOKMOESTLDD1177436", "error_code": "LDD-SOUND"}}, {"pk": 671043, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212348, "date": "2017-06-27", "report": "Teacher Veronica (0724269142) called concerned about this device was not showing the full content in all the subjects. I asked the teacher to connect the device to the cap network and the then open the connect server AP, and she was able to see all the content, I advised her to be using the updated content from the cap network. Issue resolved.", "serial_number": "gokmoestldd1179524", "error_code": "LDD-CONTENT"}}, {"pk": 645469, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221592, "date": "2017-06-12", "report": "TDD- CONTENTrnTeacher David 0712467880 called concerned that he was unable to see the TUSOME content. I advised him to connect the device to the CAP but the he did not have the charger to the CAP. He said that he will call us back after five minutes.He called back to confirm the Cap was now connected to the charger.I took him through the process of connecting the Tdd to the Cap then opening the Tusome content and confirmed that by opening English class one Tusome content.", "serial_number": "GOKMOESTTDD2001058", "error_code": "TDD - CONTENT"}}, {"pk": 745317, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221592, "date": "2017-07-06", "report": "Teacher David (724767857) called concerned about this device that was having an inverted image and a foreign language.I took her through the process of resetting and it was able to display the image uprightly and in English language.", "serial_number": "Q72G642AAAAAC0985", "error_code": "PROJECTOR-IMAGE"}}, {"pk": 645469, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221592, "date": "2017-06-12", "report": "TDD- CONTENTrnTeacher David 0712467880 called concerned that he was unable to see the TUSOME content. I advised him to connect the device to the CAP but the he did not have the charger to the CAP. He said that he will call us back after five minutes.He called back to confirm the Cap was now connected to the charger.I took him through the process of connecting the Tdd to the Cap then opening the Tusome content and confirmed that by opening English class one Tusome content.", "serial_number": "GOKMOESTTDD2001058", "error_code": "TDD - CONTENT"}}, {"pk": 745317, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221592, "date": "2017-07-06", "report": "Teacher David (724767857) called concerned about this device that was having an inverted image and a foreign language.I took her through the process of resetting and it was able to display the image uprightly and in English language.", "serial_number": "Q72G642AAAAAC0985", "error_code": "PROJECTOR-IMAGE"}}, {"pk": 645469, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221592, "date": "2017-06-12", "report": "TDD- CONTENTrnTeacher David 0712467880 called concerned that he was unable to see the TUSOME content. I advised him to connect the device to the CAP but the he did not have the charger to the CAP. He said that he will call us back after five minutes.He called back to confirm the Cap was now connected to the charger.I took him through the process of connecting the Tdd to the Cap then opening the Tusome content and confirmed that by opening English class one Tusome content.", "serial_number": "GOKMOESTTDD2001058", "error_code": "TDD - CONTENT"}}, {"pk": 745317, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221592, "date": "2017-07-06", "report": "Teacher David (724767857) called concerned about this device that was having an inverted image and a foreign language.I took her through the process of resetting and it was able to display the image uprightly and in English language.", "serial_number": "Q72G642AAAAAC0985", "error_code": "PROJECTOR-IMAGE"}}, {"pk": 311086, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212169, "date": "2017-06-30", "report": "LDD- SOFTWARE Mr Mburu 713747802 called concerned that this device was on tablet mode. I took him through the procedure of disabling the tablet mode and it worked. Issue Resolved.", "serial_number": "GOKMOESTLDD2166581", "error_code": "LDD-SOFTWARE"}}, {"pk": 540421, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212169, "date": "2017-06-30", "report": "LDD- SOFTWARE Mr Mburu 713747802 called concerned that this device was on tablet mode. I took him through the procedure of disabling the tablet mode and it worked. Issue Resolved.", "serial_number": "GOKMOESTLDD2172483", "error_code": "LDD-SOFTWARE"}}, {"pk": 479147, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212169, "date": "2017-07-06", "report": "Mr. Maina -718849855 called to be assisted on how he can register students on Net support and also on how to make the register permanent .I was able to take him through the procedure by advising him to click on register and prompt the student to register which he did successful and on permanent register I advised him to click on View, current setting, tutor then click on remember student login names. He was able to register the student and registered them permanently", "serial_number": "GOKMOESTTDD2013569", "error_code": "TDD-NETSUPPORT"}}, {"pk": 126274, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212169, "date": "2017-07-06", "report": "Mr Maina 717687342 called concerned about this device which he could not power on and see the projected content, I advised him to connect the power cable and the HDMI cable on both TDD and the projector then choose source and select any subject on the TDD and he was able to get both the image and the sound. Issue resolved", "serial_number": "q72g709aaaaac0592", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 805538, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212169, "date": "2017-07-06", "report": "Mr Maina 717687342 called concerned about this device which he could not see the registered student on the net support, I advised him to connect the student to the cap network where he confirmed he could see a yellow triangle and then on the net support we registered the student and he could see the registered student clearly, Issue resolved", "serial_number": "gokmoestldd2166767", "error_code": "LDD-NETSUPPORT"}}, {"pk": 823040, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212169, "date": "2017-07-19", "report": "Mr Mburu 713747802 called concerned that he was unable to use the show menu function. He confirmed that he had already connected the devices to the CAP network. I then advised him to launch the net support and I took him through the procedure of using the show menu function and also how to end the show function and he was able to. Issue resolved.", "serial_number": "GOKMOESTtDD2014813", "error_code": "TDD-NETSUPPORT"}}, {"pk": 419176, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212309, "date": "2017-07-10", "report": "Mr David 713599116 called concerned that he was unable to connect devices to the CAP network. I advised him to pick this device and one LDD and I took him through the procedure of connecting the devices to the CAP network and he was able to", "serial_number": "GOKMOESTTDD2013908", "error_code": "TDD-NETWORK"}}, {"pk": 902912, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212312, "date": "2017-06-30", "report": "Teacher Esther 741535618 called us today, she wanted to be taught how to connect all the devices to the cap network then register the student. I advised her to power on the cap, which she confirmed it was on and she could see a blue led light. Then power on the TDD, then go to action center then connect to the cap network , after it connected we connected one of the ldd  to the cap network, then launched the net support school. i advised her to click on the student register and after registering the student she was able to see the registered student on the net support. Issue resolved.", "serial_number": "GOKMOESTTDD2012605", "error_code": "TDD-NETSUPPORT"}}, {"pk": 31523, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212312, "date": "2017-07-06", "report": "Esther- 741535618called to report that she was unable to register one student on Net support. I asked her to confirm if the one LDD (GOKMOESTLDD2180211) was connected to the CAP Network which she did by confirming to see a yellow exclamation mark on the Network icon. I asked her to confirm if the LDD was appearing on the Net Support Dashboard which she said the LDD is grey in color. I asked her to refresh the page but still the LDD was not showing. I advised her to disconnect the network and reconnect but still the problem persisted. I advised her to cold reboot the device and on powering it on the LDD appeared on the Net support Dashboard and she was able to prompt register to that particular device", "serial_number": "GOKMOESTLDD2180211", "error_code": "LDD-NETSUPPORT"}}, {"pk": 569609, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212312, "date": "2017-07-06", "report": "Teacher Esther 741535618 called , she wanted to be taught how to connect  the devices to the cap network then register the student. I advised her to power on the cap, which she confirmed it was on and she could see a blue led light. Then power on the ldd  and go to the notification area then choose settings and click on the connect server AP which is the cap network, the device connected to the cap network. Issue resolved.", "serial_number": "gokmoestldd2177329", "error_code": "LDD-NETWORK"}}, {"pk": 285927, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212312, "date": "2017-07-06", "report": "Teacher Esther 705116801 called today to get assistance on how to connect the projector to the TDD. She informed me that the only thing she could see on the projection was 'no source found'. I asked her to connect the HDMI cable firmly to the projector and on doing that she got the image from the TDD.", "serial_number": "Q72G709AAAAAC0757", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 44860, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212312, "date": "2017-07-06", "report": "Teacher Esther 741535618 called today to get assistance on how to reduce the keyboard on this LDD. She informed me that the student could not see what they were typing on the screen. I asked her to launch the keyboard and select the split keyboard icon to divide it and she was successful in the process. Problem solved.", "serial_number": "GOKMOESTldd2179958", "error_code": "LDD-SOFTWARE"}}, {"pk": 323275, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212312, "date": "2017-07-06", "report": "Teacher Esther 741535618 called , she wanted to be taught how to connect the devices to the cap network then register the student. I advised her to power on the cap, which she confirmed it was on and she could see a blue led light. Then power on the ldd and go to the notification area then choose settings and click on the connect server AP which is the cap network, the device connected to the cap network. Issue resolved.", "serial_number": "gokmoestldd2178968", "error_code": "LDD-NETWORK"}}, {"pk": 927190, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212312, "date": "2017-07-10", "report": "Madam Esther  called today in regards to net support where she said she had connected about 20 Ldds to the Cap network but she could only see 5 of them.I took her through the auto arrange process and she could only see 8. I asked her to power off the cap and restart the device again and she was able to see all the connected ldds. Issue Resolved.", "serial_number": "Gokmoesttdd2012150", "error_code": "TDD-NETSUPPORT"}}, {"pk": 998636, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 205600, "date": "2017-07-24", "report": "Mr Anthony called concerned that this device was not charging. I advised him to connect the device to a working charger and he could not see any LED light. He later confirmed that he was using the wrong charger 5V 2A and that he will use the right charger to charge the device.", "serial_number": "GOKMOESTTDD2010569", "error_code": "TDD-NOT-CHARGING"}}, {"pk": 48629, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202040, "date": "2017-07-01", "report": "Mr. Moses (712040045)called to report that the color on his task bar was white and not black. I advised him to go to settings,personalize,colors,contrast settings and then select black. He then confirmed that the task bar was back to black.", "serial_number": "GOKMOESTLdd2006460", "error_code": "LDD-SOFTWARE"}}, {"pk": 412317, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202040, "date": "2017-07-01", "report": "Mr. Moses (712040045)called to report that he was getting 'update software' error. I told him that is normal for windows 10 and that if the error appears on the screen, he should open then close it immediately.", "serial_number": "GOKMOEStTDD1001550", "error_code": "TDD-SOFTWARE"}}, {"pk": 561546, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202040, "date": "2017-07-12", "report": "Mr Moses 712040045 called concerned that the task bar of this device was too large. I advised him to hold and drag the task bar towards the bottom of the screen but he was unable to. I then advised him to try the procedure and call us back. He called us back and he confirmed that he was able to lock the task bar and the device is working properly. Issue resolved.", "serial_number": "gokmoestldd2006346", "error_code": "LDD-SOFTWARE"}}, {"pk": 443428, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202040, "date": "2017-07-17", "report": "Teacher Moses (712040045) called concerned about this device displaying the task bar on large icons.I advised him to search for taskbar and navigation then click use small icons.After clicking on use small icons the problem persisted and the call disconnected before we could proceed.He later called to confirm that the device was now ok thus issue sorted.", "serial_number": "GOKMOESTLDD2006471", "error_code": "LDD-SOFTWARE"}}, {"pk": 908458, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202075, "date": "2017-07-06", "report": "Madam Rosemary 702966143 of St.Teresa primary school Marsabit county called from Sakuu primary school concerned that she was unable to register students on this device . I advised her to confirm that the device and one LDD are connected to the CAP network and then took her through the procedure of registering students and it worked.", "serial_number": "GOKMOESTTDD2014168", "error_code": "TDD-NETSUPPORT"}}, {"pk": 893303, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202313, "date": "2016-09-07", "report": "The teacher called concerned that the device was not powering up but it showed a blue LED light.I advised the teacher to long press the power button for around 10 seconds but he said the led light changed to red but still could not power on.I advised the teacher to disconnect the charger and connect it firmly on the LDD then power it on again and the device powered up.issue resolved.", "serial_number": "GOKMOESTLDD2005772", "error_code": "LDD-NOT-POWERING-ON"}}, {"pk": 409678, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202313, "date": "2016-09-07", "report": "The teacher called concerned that the device was not powering up but it showed a blue LED light.I advised the teacher to long press the power button for around 10 seconds but he said the led light changed to red but still could not power on.I advised the teacher to disconnect the charger and connect it firmly on the LDD then power it on again and the device powered up.issue resolved.", "serial_number": "GOKMOESTLDD2005440", "error_code": "LDD-NOT-POWERING-ON"}}, {"pk": 668258, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202313, "date": "2016-09-29", "report": "L.D.D - TOUCH SCREEN - I Made a follow up call and spoke to Mrs ESTHER 0725419826 The teacher said that after powering on the L.D.D , She could see the desktop but could not open the icons on the desktop because the device was not responding to touch. I advised the teacher to cold reboot the device and after powering the device off and then on, the device worked well and she could open the icons.", "serial_number": "GOKMOESTLDD2005443", "error_code": "LDD - TOUCH SCREEN"}}, {"pk": 527666, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202313, "date": "2016-09-29", "report": "L.D.D - TOUCH SCREEN - I Made a follow up call and spoke to Mrs ESTHER 0725419826 The teacher said that after powering on the L.D.D , She could see the desktop but could not open the icons on the desktop because the device was not responding to touch. I advised the teacher to cold reboot the device and after powering the device off and then on, the device worked well and she could open the icons", "serial_number": "GOKMOESTLDD2007028", "error_code": "LDD - TOUCH SCREEN"}}, {"pk": 462688, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202313, "date": "2016-09-29", "report": "T.D.D HANGING  - I Made a follow up call and spoke to Mrs ESTHER 0725419826 The teacher said that after powering on the TDD , She could see the teacher log in but when clicking on it to log in the device could not respond. I asked the teacher to cold reboot the device and she confirmed she could log in to the teacher's account and use the device comfortably.", "serial_number": "GOKMOESTTDD2000161", "error_code": "TDD - HANGING"}}, {"pk": 74463, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202598, "date": "2017-06-12", "report": "Teacher Dorothy(0725790912) called concerned about this device not producing sound.I advised her to play a different content which was now producing sound.On playing the previous content,it was now able to produce sound thus resolved.", "serial_number": "GOKMOESTLDD2005460", "error_code": "LDD - SOUND"}}, {"pk": 788112, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202598, "date": "2017-06-20", "report": "LDD- SOUND Madam Dorothy 0725790912 called concerned that this device was not producing sound yet the volume percentage was at 100%. I advised her to cold boot the device by long pressing the power button then power it back on. I then advised her to play a content and she could get the sound. Issue resolved.", "serial_number": "GOKMOESTLDD2006884", "error_code": "LDD-SOUND"}}, {"pk": 526586, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202598, "date": "2017-06-21", "report": "Madam Dorothy725790912 called us today in regards to this device which was playing the content of science but it could not play the video. I asked if she was using the updated content from the cap, she confirmed that there was no power in the school so she was just using the content from the devices. I advised her to call us back when the power is back so that I can show her how to get the updated content from the cap. We later made a follow up call and the teacher confirmed that she was able to use the content from the cap and the content video played. Issue resolved.", "serial_number": "gokmoestldd2006593", "error_code": "LDD - CONTENT"}}, {"pk": 94502, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202753, "date": "2017-06-08", "report": "TDD- HANGING Madam Ruth 0721859988 called that she was unable to sign in using the teachers account and shut down the device using the start button. I advised him to cold boot the device using the power button and power it back on but she could still not shut down the device using the start button and she was unable to open the content on the desktop. I advised her to cold boot the device again by long pressing the power button and powering it back on and she was able to see and open the desktop icons and power off the device using the start button. Issue resolved.", "serial_number": "GOKMOESTTDD2001363", "error_code": "TDD - HANGING"}}, {"pk": 11152, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202753, "date": "2017-06-08", "report": "LDD- SOFTWARE Madam Ruth 0721859988 called concerned that this device was requesting for administrator password. I advised her to sign in using the teachers account and she was able to see the desktop icons. Issue resolved.", "serial_number": "GOKMOESTLDD2058424", "error_code": "LDD - SOFTWARE"}}, {"pk": 445018, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202753, "date": "2017-06-08", "report": "LDD- AUTOMATIC REPAIR Madam Ruth 0721859988 called concerned that this device displayed automatic repair on the desktop and was unable to access the desktop icons. I advised her to long press on the power button until the device shuts down then power the device back on and the device worked well. Issue resolved.", "serial_number": "GOKMOESTLDD2055997", "error_code": "LDD - IMAGE"}}, {"pk": 736128, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202753, "date": "2017-07-13", "report": "Mr. Boniface 725016402 called  to report that this device was not charging. I advised him to get the devices and then call us back for more assistance. We later called the teacher and he confirmed that he changed the devices and they are now working properly.", "serial_number": "GOKMOESTLDD2057168", "error_code": "LDD-NOT-CHARGING"}}, {"pk": 276726, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202753, "date": "2017-07-13", "report": "Mr. Boniface 725016402 called to report that this device was not charging. I advised him to get the devices and then call us back for more assistance. We later called back and the teacher confirmed that the device charged and it is working properly.", "serial_number": "GOKMOESTTDD2001363", "error_code": "TDD-NOT-CHARGING"}}, {"pk": 276381, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202609, "date": "2017-03-14", "report": "LDD NETWORK CONNECTION Mrs.Kinoti 728148014 from IthiMbari Primary School in Meru County called to be assisted on how to connect the devices to the CAP Network, I was able to assist him to connect this device by advising him to select the Network icon on the notification area and connect to the CAP Network. PROBLEM SOLVED", "serial_number": "GOKMOESTLDD2078747", "error_code": "LDD-NETWORK"}}, {"pk": 120333, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202609, "date": "2017-03-14", "report": "LDD NETWORK CONNECTION Mrs.Kinoti 728148014 from IthiMbari Primary School in Meru County called to be assisted on how to connect the devices to the CAP Network, I was able to assist him to connect this device by advising him to select the Network icon on the notification area and connect to the CAP Network. PROBLEM SOLVED", "serial_number": "GOKMOESTLDD2078614", "error_code": "LDD-NETWORK"}}, {"pk": 614477, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202609, "date": "2017-03-14", "report": "LDD NETWORK CONNECTION Mrs.Kinoti 728148014 from IthiMbari Primary School in Meru County called to be assisted on how to connect the devices to the CAP Network, I was able to assist him to connect this device by advising him to select the Network icon on the notification area and connect to the CAP Network.  PROBLEM SOLVED", "serial_number": "GOKMOESTLDD2074772", "error_code": "LDD-NETWORK"}}, {"pk": 926731, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202596, "date": "2017-05-08", "report": "Teacher Dorothy called to inform us that she could not get sound or image after connecting this device to the TDD (GOKMOESTTDD2001449). I advised her to fix the HDMI cable firmly and then press on the HDMI button on the remote. After going through this procedure she was able to get both the image and sound. She also informed me that she had gone to Rurama primary to assist them and that she is a teacher at St. Jude primary. Problem solved", "serial_number": "Q72G646AAAAAC0371", "error_code": "PROJECTOR CONNECTION"}}, {"pk": 622007, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202590, "date": "2017-07-18", "report": "Teacher Alice (723790922)called concerned unable to connect the projector in order to display the Tdd's image.I took her through the connection process and she confirmed this by viewing the Tdd's image thus resolved.", "serial_number": "Q72G646AAAAAC0575", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 356593, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202590, "date": "2017-07-18", "report": "Madam ALICE 726178792 called in regards to this device which was asking for net support activation. I advised the teacher to use his smart phone to connect hot spot and on the TDD side she was able to see the network from her phone. I then advised her to launch the net support and she was able to activate the net support and it is now working properly.", "serial_number": "gokmoesttdd2001334", "error_code": "TDD-NETSUPPORT-ACTIVATION"}}, {"pk": 622007, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202590, "date": "2017-07-18", "report": "Teacher Alice (723790922)called concerned unable to connect the projector in order to display the Tdd's image.I took her through the connection process and she confirmed this by viewing the Tdd's image thus resolved.", "serial_number": "Q72G646AAAAAC0575", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 356593, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202590, "date": "2017-07-18", "report": "Madam ALICE 726178792 called in regards to this device which was asking for net support activation. I advised the teacher to use his smart phone to connect hot spot and on the TDD side she was able to see the network from her phone. I then advised her to launch the net support and she was able to activate the net support and it is now working properly.", "serial_number": "gokmoesttdd2001334", "error_code": "TDD-NETSUPPORT-ACTIVATION"}}, {"pk": 622007, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202590, "date": "2017-07-18", "report": "Teacher Alice (723790922)called concerned unable to connect the projector in order to display the Tdd's image.I took her through the connection process and she confirmed this by viewing the Tdd's image thus resolved.", "serial_number": "Q72G646AAAAAC0575", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 356593, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202590, "date": "2017-07-18", "report": "Madam ALICE 726178792 called in regards to this device which was asking for net support activation. I advised the teacher to use his smart phone to connect hot spot and on the TDD side she was able to see the network from her phone. I then advised her to launch the net support and she was able to activate the net support and it is now working properly.", "serial_number": "gokmoesttdd2001334", "error_code": "TDD-NETSUPPORT-ACTIVATION"}}, {"pk": 759004, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202359, "date": "2017-07-05", "report": "Teacher Silas(720376568)called concerned about this device powering on but displaying black screen.I advised her to cold boot the device and it was able to open now with the desktop icons available thus resolved.", "serial_number": "GOKMOESTTDD2013062", "error_code": "TDD-DISPLAY"}}, {"pk": 373446, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202359, "date": "2017-07-25", "report": "Teacher Silas (0720376568) called concerned about this device not projecting the Tdd's image.I took her through the process of selecting HDMI as the source and it was now working properly.", "serial_number": "Q72G705AAAAAC1133", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 640752, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202479, "date": "2017-06-19", "report": "TDD- HANGING Madam Naomi 0728362961 called concerned that she was unable to sign in using the teachers account. I advised her to cold boot the device by long pressing on the power button to shut down the device then power it back on. I then advised her to sign in and she was able to see the desktop.", "serial_number": "GOKMOESTtDD2008739", "error_code": "TDD-HANGING"}}, {"pk": 807321, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202548, "date": "2017-07-26", "report": "Madam Virginia 721637829 called us today in regards to this device which was hanging. I advised the teacher to cold reboot the device and upon powering on the device worked properly. Issue resolved.", "serial_number": "gokmoesttdd2013233", "error_code": "TDD-HANGING"}}, {"pk": 934551, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202656, "date": "2017-06-02", "report": "Teacher Beryl (0724359834) called concerned about being unable to connect this device to the CAP.I took her through the connection process and this was confirmed by the availability of the yellow hazard indicator thus resolved.", "serial_number": "GOKMOESTTDD2013008", "error_code": "TDD-NETWORK"}}, {"pk": 521363, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202663, "date": "2017-06-02", "report": "Teacher Mbaya 789533458 called in regards to this device which was not producing sound, I advised the teacher to play one of the content, and the topic played and she was able to get the sound. Issue resolved.", "serial_number": "gokmoestldd2038524", "error_code": "LDD - CONTENT"}}, {"pk": 650318, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202896, "date": "2017-07-10", "report": "LDD- TOUCH SCREEN Mr James 711578151 called concerned that this device was hanging. I advised him to cold boot the device but he disconnected the call before we could finish troubleshooting We later called back and Mr James confirmed that the device was working well.", "serial_number": "gokmoestldd2118119", "error_code": "LDD-TOUCH-SCREEN"}}, {"pk": 467047, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202896, "date": "2017-07-18", "report": "Mr James 711578151 called in regards to this projector which was not displaying anything on the white board. I advised him to connect the HDMI cable and firm the connection and on top of the projector he was able to choose the source and after that the device was able to project the image on the TDD. Issue resolved.", "serial_number": "q72g647aaaaac0698", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 563000, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202896, "date": "2017-07-27", "report": "Mr James 711578151 called concerned that he was unable to connect the VGA cable to the VGA converter. He disconnected the call before we could finish the connection procedure. Mr James 711578151 later called back and I advised him to connect the VGA cable to the VGA converter but he was unable to, He said that the port on the VGA converter was too small. He then disconnected the call. Mr James later called back and I took him through the connection procedure and it worked. Issue resolved.", "serial_number": "q72g647aaaaac0698", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 483930, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202913, "date": "2017-06-07", "report": "LDD- NETWORK Madam Mercy 0713663665 called concerned that she was unable to connect this device to the CAP network. She confirmed that the CAP had a steady blue LED light and advised her to power off the CAP and power it back on so as to get a blinking blue LED light. I then advised her to go to the action center then select all settings but it was not responding, I then advised her to go to the start button and click on settings but it could also not respond. I then took her through the cold booting procedure and advised her to go to the action center and she was now able to connect this device to the CAP network.", "serial_number": "GOKMOESTLDD2190311", "error_code": "LDD-NETWORK"}}, {"pk": 976004, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202913, "date": "2017-06-07", "report": "TDD- NET SUPPORT ACTIVATIONrnMadam Mercy 0713663665 called concerned that this device was requesting for net support activation when she launched the net support. I advised her to call us back using another phone and load her phone with bundles so as to take her through the procedure of activating the net support.She called back and i took her through the process of activation thus solved.I also took her through the process of registering and using the show function.", "serial_number": "GOKMOESTTDD2002570", "error_code": "TDD-NETSUPPORT ACTIVATION"}}, {"pk": 627245, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202913, "date": "2017-06-08", "report": "Teacher Mercy (0713663665) called concerned to be shown how to connect this device to the CAP and while taking her through the process,the device went off.I therefore advised her to charge it then call us back. We later called back and teacher Mercy 0713663665 confirmed that the device was now working well.", "serial_number": "GOKMOESTTDD2002696", "error_code": "TDD-NETWORK"}}, {"pk": 84513, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202940, "date": "2017-07-13", "report": "Madam Carol 728752802 called us today in regards to this device which was not connecting to the cap network. I advised her to power on the cap and click on the notification area then connect to the cap network and she was able to get the confirmation of the yellow triangle. Issue resolved.", "serial_number": "gokmoesttdd2012812", "error_code": "TDD-NETWORK"}}, {"pk": 740876, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202940, "date": "2017-07-14", "report": "Madam Caroline 728752802 called in regards to this device which was not responding when she was trying to sign in. I advised her to cold reboot the device and after powering on the device it worked properly. Issue resolved.", "serial_number": "gokmoesttdd2013059", "error_code": "TDD-HANGING"}}, {"pk": 335932, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202940, "date": "2017-07-20", "report": "Teacher Caro 714806572 called concerned that she was unable to do connection on this device . I advised her to connect the device to the power cable then power it on. I then advised her to connect HDMI cable to the TDD and the device and she was able to. I therefore advised her to click on the source button and select HDMI and she was see the projection and get sound.", "serial_number": "q72g646aaaaac0438", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 259690, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202365, "date": "2017-07-11", "report": "Mr Karegi called concerned that the net support on this device was requesting for net support activation. I took him through the procedure of enabling the hotpot on his phone and he was able to. I then advised him to launch the net support and click on activate online and he was able to but the bundles got finished before it could activate. I then advised him to call us back after he has loaded more bundles in his phone. Mr Karegi later called back and I was able to take him through the net support activation procedure and it worked.", "serial_number": "GOKMOESTTDD2016750", "error_code": "TDD-NETSUPPORT-ACTIVATION"}}, {"pk": 744174, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207651, "date": "2017-05-09", "report": "AUTOMATIC REPAIR-Teacher Marion (0712077104) called in regards to this device that was having an automatic repair error message once she powered it on she tried to troubleshoot but it was not working well,after cold booting the device,the teacher confirmed that it was working well.issue resolved.", "serial_number": "GOKMOESTLDD2008855", "error_code": "LDD - IMAGE"}}, {"pk": 111462, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207651, "date": "2017-09-11", "report": "Madam Marion 0712077104 called to inform us that this device could now charge. She said that she could now see the percentage increase from 0 to 18%. She confirmed that the device was now working well. Issue resolved.", "serial_number": "GOKMOESTTDD2000176", "error_code": "TDD-NOT-CHARGING"}}, {"pk": 744984, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208009, "date": "2017-03-07", "report": "Teacher Rose 720904890 called in regards to this device which was asking for admin password when signing in. I advised the teacher to long press on the power button for a few second and power it on again, and sign in as a student, The device worked properly, i told her to always sign in as a student on the LDD'S. She also confirmed she could not see the desktop icons ,I advised her to long press on an empty space and she saw the option box and after choosing view, and click on the show desktop. Issue resolved", "serial_number": "gokmoestldd1184702", "error_code": "LDD - SOFTWARE"}}, {"pk": 329423, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208009, "date": "2017-03-07", "report": "Teacher Rose 720904890 called in regards to this device which was not showing the desktop icons, and only displaying the all apps. I advised her to go the notification area and check if the tablet mode is active. She confirmed it was and upon deactivating the device worked properly. Issue Resolved.", "serial_number": "gokmoestldd1182722", "error_code": "LDD - SOFTWARE"}}, {"pk": 958278, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207858, "date": "2017-07-03", "report": "TDD- NET SUPPORT Teacher Mary 724019438 called concerned that she was unable to register students using this device. She confirmed that she had already connected the devices to the CAP network.I then took her through the procedure of creating a new room and it worked. I then took her through the procedure of registering students using the student register function on the TDD and it worked.", "serial_number": "GOKMOESTTDD1001903", "error_code": "TDD-NETSUPPORT"}}, {"pk": 958278, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207858, "date": "2017-07-03", "report": "TDD- NET SUPPORT Teacher Mary 724019438 called concerned that she was unable to register students using this device. She confirmed that she had already connected the devices to the CAP network.I then took her through the procedure of creating a new room and it worked. I then took her through the procedure of registering students using the student register function on the TDD and it worked.", "serial_number": "GOKMOESTTDD1001903", "error_code": "TDD-NETSUPPORT"}}, {"pk": 212638, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207959, "date": "2017-06-23", "report": "TDD- CONTENT Madam Rachael 0724533218 called concerned that she could not find the teachers training manual that she wanted to use to teach other teachers about the devices. I advised her to go to the desktop and locate an icon with the name Teachers training manual and she was able to but when she opened it the manual could not load. I advised her that a follow up will be made. We later called her and emailed her the training manual on rachealwamaitha5@gmail.com", "serial_number": "GOKMOESTTDD1001637", "error_code": "TDD-CONTENT"}}, {"pk": 212638, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207959, "date": "2017-06-23", "report": "TDD- CONTENT Madam Rachael 0724533218 called concerned that she could not find the teachers training manual that she wanted to use to teach other teachers about the devices. I advised her to go to the desktop and locate an icon with the name Teachers training manual and she was able to but when she opened it the manual could not load. I advised her that a follow up will be made. We later called her and emailed her the training manual on rachealwamaitha5@gmail.com", "serial_number": "GOKMOESTTDD1001637", "error_code": "TDD-CONTENT"}}, {"pk": 876728, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207776, "date": "2017-07-04", "report": "PROJECTOR- DISPLAY Mr David 772546646 called concerned that he was unable to see the projection on the white board. He confirmed that he had already done the connection and I advised him to click on the action center then click on project and select duplicate and it worked. Issue resolved.", "serial_number": "WD4K6701562", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 410980, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207963, "date": "2017-05-31", "report": "PROJECTOR CONNECTION. Madam Esther 0723888236 called concerned that she was unable to connect the projector to the TDD.I advised her to connect the power cable to the projector then power it on. Then connect the HDMI cable firmly to both the TDD and the projector. I then advised her to select source then click on HDMI and select enter and it worked. Issue resolved.", "serial_number": "q72g628aaaaac0906", "error_code": "PROJECTOR CONNECTION"}}, {"pk": 264737, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207989, "date": "2017-03-15", "report": "Teacher Elizabeth (710412201) called for assistance on how to register students on net support using this device. I advised her to connect this device and one LDD (2005264) to the CAP network and then launch net support. I asked her to select student register on the tool bar and then select sign in. I then asked her to prompt the students to register and she was successful in the process. Problem solved.", "serial_number": "GOKMOESTTDD2001897", "error_code": "TDD - NETSUPPORT"}}, {"pk": 973971, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207989, "date": "2017-06-27", "report": "Mr John 723222263 called in regards to this device which he was unable to send the keyboard from his TDD. I told the teacher that he does not need to send the keyboard because the learner’s device has a virtual keyboard, I advised him to check on the bottom right of the device and click on the rectangular icon which is the virtual keyboard. Issue resolved.", "serial_number": "gokmoestldd2005268", "error_code": "LDD-SOFTWARE"}}, {"pk": 980638, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207647, "date": "2017-07-19", "report": "Madam Ann 722593711 called us today in regards to this device which was showing an error message of automatic repair. I advised her to cold reboot the device and power the device back on. After powering the device the error message was still there, i advised her to cold reboot the device again but the call disconnected. Madam Ann 722593711 later called back and confirmed that the device was now working well.", "serial_number": "gokmoestldd2100256", "error_code": "LDD-IMAGE"}}, {"pk": 555983, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207695, "date": "2017-07-13", "report": "Teacher Martha (721968118) called in regards to this device and said it was not powering on.i advised her to plug the device to a working charger and she was able to see a red led light,i advised her to long press on the power button for about five seconds but the device could not power on,i advised her to let the device charge for about two hours and give us a call on the progress.On calling him back,he confirmed that the device was now powering thus solved.", "serial_number": "GOKMOESTLDD2092133", "error_code": "LDD-NOT-POWERING-ON"}}, {"pk": 275372, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207735, "date": "2017-07-06", "report": "LDD- AUTOMATIC REPAIR Madam Caroline 710398686 called concerned that this device had 'automatic repair restart your PC'. I advised her to cold boot the device and he was able to see the desktop. Issue resolved.", "serial_number": "gokmoestldd2123540", "error_code": "LDD-IMAGE"}}, {"pk": 125585, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207735, "date": "2017-07-11", "report": "Teacher Caroline (720981700) concerned about this device unable to access the desktop icons.On probing,i realized  that the device was on tablet mode.I advised her to deactivate the tablet mode thus now able to display the desktop icons.", "serial_number": "GOKMOESTLDD2102461", "error_code": "LDD-SOFTWARE"}}, {"pk": 97528, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207735, "date": "2017-07-17", "report": "LDD- AUTOMATIC REPAIRrnMadam Caroline 710398686 called concerned that this device had 'automatic repair restart your PC'. I advised her to cold boot the device but the call got disconnected before we could finish trouble shooting.On calling her back ,she confirmed that after she cold booted,the device was now ok thus issue resolved.", "serial_number": "gokmoestldd2103326", "error_code": "LDD-IMAGE"}}, {"pk": 620778, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207738, "date": "2017-06-28", "report": "Madam Sarah 724877073 called us today in regards to this device which she could not connect the cable to display the projection to the white board. I advised the teacher to use the VGA cable and after connecting the cable firmly she was able to get the projection on the white board. Issue resolved.", "serial_number": "q72g705aaaaac0782", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 600655, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207738, "date": "2017-06-28", "report": "LDD- NET SUPPORT Teacher Grace 0710499791 called concerned that she was unable to get this device registered on the net support. I advised her to connect this device and the TDD to the CAP network and she was able to. I then took her through the procedure of registering the student using the student register icon on the net support and it worked", "serial_number": "Gokmoestldd2097220", "error_code": "LDD-NETSUPPORT"}}, {"pk": 876291, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207811, "date": "2017-09-11", "report": "Mr. Mwangi 0722227026 called in regards to this device which was not giving the correct commands, like when he was typing the letter U it was giving him number 4. I advised him to press fn and Num lock simultaneously, and the device worked properly. Issue resolved", "serial_number": "gokmoesttdd2004946", "error_code": "TDD-SOFTWARE"}}, {"pk": 217173, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207835, "date": "2017-07-06", "report": "Madam Elizabeth 712375023  called us today in regards to this device which was not blinking blue light on top. I advised the teacher to cold boot the devices then power it back on. Immediately the blue blinking led light was seen. I advised the teacher to connect one of the ldd and she was able to connect to the cap network. Issue resolved.", "serial_number": "1c497b9f211a", "error_code": "CAP-NO-NETWORK"}}, {"pk": 28060, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208375, "date": "2017-06-22", "report": "Madam Margaret 720563526 called  us today in regards to this device which was not showing desktop icons. I advised the teacher to click on an empty place and choose view then click on show desk top icons. The issue was resolved.", "serial_number": "gokmoestldd2114607", "error_code": "LDD-SOFTWARE"}}, {"pk": 28060, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208375, "date": "2017-06-22", "report": "Madam Margaret 720563526 called  us today in regards to this device which was not showing desktop icons. I advised the teacher to click on an empty place and choose view then click on show desk top icons. The issue was resolved.", "serial_number": "gokmoestldd2114607", "error_code": "LDD-SOFTWARE"}}, {"pk": 28060, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208375, "date": "2017-06-22", "report": "Madam Margaret 720563526 called  us today in regards to this device which was not showing desktop icons. I advised the teacher to click on an empty place and choose view then click on show desk top icons. The issue was resolved.", "serial_number": "gokmoestldd2114607", "error_code": "LDD-SOFTWARE"}}, {"pk": 28060, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208375, "date": "2017-06-22", "report": "Madam Margaret 720563526 called  us today in regards to this device which was not showing desktop icons. I advised the teacher to click on an empty place and choose view then click on show desk top icons. The issue was resolved.", "serial_number": "gokmoestldd2114607", "error_code": "LDD-SOFTWARE"}}, {"pk": 28060, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208375, "date": "2017-06-22", "report": "Madam Margaret 720563526 called  us today in regards to this device which was not showing desktop icons. I advised the teacher to click on an empty place and choose view then click on show desk top icons. The issue was resolved.", "serial_number": "gokmoestldd2114607", "error_code": "LDD-SOFTWARE"}}, {"pk": 829835, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207960, "date": "2017-07-05", "report": "Madam Beatrice 724821876 called us today in regards to the device which she was not able to connect to the cap network. I advised the teacher to power on the cap and she confirmed she was able to see the blue blinking light. I advised her to click on the notification area on the TDD then choose setting and connect to the cap network. She was able to connect the device to the cap network .Issue resolved.", "serial_number": "GOKMOESTTDD2005250", "error_code": "TDD-NETWORK"}}, {"pk": 796385, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208007, "date": "2017-07-06", "report": "Madam Rhoda 726028727 called in regards to this device which was not powering off when she uses the start window icon to shut down the device, it was not responding. I advised her to cold reboot the device and upon powering on the device worked well and she was able to shut down the device. Issue resolved.", "serial_number": "gokmoestldd2088538", "error_code": "LDD-TOUCH-SCREEN"}}, {"pk": 796385, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208007, "date": "2017-07-06", "report": "Madam Rhoda 726028727 called in regards to this device which was not powering off when she uses the start window icon to shut down the device, it was not responding. I advised her to cold reboot the device and upon powering on the device worked well and she was able to shut down the device. Issue resolved.", "serial_number": "gokmoestldd2088538", "error_code": "LDD-TOUCH-SCREEN"}}, {"pk": 528280, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208072, "date": "2017-06-29", "report": "LDD- SOFTWARE Teacher Lucy 724097696 called concerned that the task bar of this device was not responding to touch. I took her through the procedure of cold booting the device and advised her to tap on the action center and it responded. Issue resolved", "serial_number": "GOKMOESTLDD2117491", "error_code": "LDD-SOFTWARE"}}, {"pk": 811135, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208072, "date": "2017-06-29", "report": "LDD- TOUCH SCREEN Teacher Lucy 724097696 called concerned that she was unable to access the desktop of this device. I advised her to cold boot the device and she was able to access the desktop but there were no desktop icons. I advised her to long press on an empty space and select view then show desktop icons and it worked.", "serial_number": "GOKMOESTLDD2132899", "error_code": "LDD-TOUCH-SCREEN"}}, {"pk": 915902, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208072, "date": "2017-07-06", "report": "Teacher Lucy 724097696 called concerned that she was unable to see the connected students on the net support. She confirmed that she had connected this device to the CAP network and I took her through the procedure of creating a new room and she was able to see the connected students.", "serial_number": "GOKMOESTtDD2006271", "error_code": "TDD-NETWORK"}}, {"pk": 971433, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208072, "date": "2017-07-07", "report": "Teacher Lucy(724097696) called today in regards to this device that was hanging and she said she could not sign in.I asked her to cold boot the device by long pressing the power button until the device goes off.she confirmed that the device was working well after i asked her to power it back on and i asked her to open a content to verify that the device was now working well.Issue Resolved.", "serial_number": "GOKMOESTTDD2005997", "error_code": "TDD-HANGING"}}, {"pk": 761009, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208072, "date": "2017-07-10", "report": "Madam Lucy 724097696 called in regards to this device which was not displaying any image on the white board. I advised the teacher to click on the notification area on the TDD side and click on the notification area then choose project and click on  duplicate. Then she was able to see the projected image on the white board, issue resolved.", "serial_number": "q72g702aaaaac0840", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 744848, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208072, "date": "2017-07-19", "report": "Teacher Lucy (724097696)called concerned about this device unable to be registered on the net support.I took her through the process of cold booting and refreshing class but the problem persisted.I therefore advised her to try it again later and call us back with the progress. We later called back and Teacher Lucy 724097696 confirmed that she was able to resolve the issue and that the device was now working well.", "serial_number": "GOKMOESTLDD2117938", "error_code": "LDD-NETSUPPORT"}}, {"pk": 488262, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208089, "date": "2017-05-09", "report": "TDD NETWORK CONNECTION Mr.Bildad from Huho-ini Primary School in Muranga County called today to be assisted on how to connect this device to the CAP Network. I was able to take him through the process by advising him to go on the action centre, click on the all settings option, click on Network and Internet and then connect to the CAP Network which he did successfully. He also wanted to know how to get the Tusome Content which I advised him to open connect server AP and scroll downwards up to Tusome PDF right click and open, which he was able to find. Thirdly he needed to be assisted on how he can manage a class using Net support. I was able to assist him by showing him the major Functions on Net support which are Show function and student register. PROBLEM SOLVED", "serial_number": "GOKMOESTTDD2005099", "error_code": "TDD-NETWORK"}}, {"pk": 797093, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208089, "date": "2017-05-09", "report": "LDD NETWORK CONNECTION Mr.Bildad – 723680347 from Huho-ini Primary School in Muranga County called today to be assisted on how to connect this device to the CAP Network. I was able to take him through the process by advising him to go on the action centre, click on the all settings option, click on Network and Internet and then connect to the CAP Network which he did successfully.  PROBLEM SOLVED", "serial_number": "GOKMOESTLDD2110970", "error_code": "LDD-NETWORK"}}, {"pk": 806871, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208101, "date": "2017-06-30", "report": "Mr. John-722250010 called to report this device which was showing activate windows but the screen was not displaying the desktop icons, I advised him to long press on the desktop then click view and select show desktop and after following the procedure the device responded and he was able to view the desktop. PROBLEM SOLVED", "serial_number": "GOKMOESTLDD2117339", "error_code": "LDD-DOA-SOFTWARE"}}, {"pk": 351388, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208101, "date": "2017-07-17", "report": "Teacher John (721823784) called concerned about this device producing whizzing sound while using the camera.I took him through the process of cold booting more than 2 times thus it was now not producing the whizzing sound.", "serial_number": "GOKMOESTLDD2137033", "error_code": "LDD-SOUND"}}, {"pk": 314838, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208101, "date": "2017-07-17", "report": "Teacher John (721823784) called concerned about this device producing whizzing sound while using the camera.I took him through the process of cold booting more than 2 times thus it was now not producing the whizzing sound.", "serial_number": "GOKMOESTLDD2122686", "error_code": "LDD-SOUND"}}, {"pk": 170203, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208101, "date": "2017-07-17", "report": "Teacher John (721823784) called concerned about this device producing whizzing sound while using the camera.I took him through the process of cold booting more than 2 times thus it was now not producing the whizzing sound.", "serial_number": "GOKMOESTLDD2137052", "error_code": "LDD-SOUND"}}, {"pk": 264761, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208101, "date": "2017-07-21", "report": "Teacher John (721823784) called concerned about this device not powering on.I advised him to connect it to the charger and the led light was indicating blue.I therefore advised him to let it charge it for 2hrs then call us back with the feedback.We called him back and he confirmed the device was now powering on thus resolved.", "serial_number": "GOKMOESTLDD2134794", "error_code": "LDD-NOT-POWERING-ON"}}, {"pk": 804117, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208030, "date": "2017-07-12", "report": "Teacher Anne (724499094)called in regards to this device and she said it was on the previous session that she had when she was using the show function,as i was taking her through the process of ending the show function her tdd went off and there was no power in the school thus i took her through the process of cold rebooting this device and she was able to acess the ldd's desktop.", "serial_number": "GOKMOESTldd2114125", "error_code": "LDD-NETSUPPORT"}}, {"pk": 301397, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208030, "date": "2017-07-12", "report": "Teacher anne(724499094) called and said that she was on net support and one of the Ldds was still on the previous session she was in when she was using the show function but all the other ldds went back to their desktops,i confirmed that she did not end the show function after troubleshooting and when i was taking her through the process of ending the show function her tdd went off and there was no power,i asked her to get the other tdd and call us back so that we could show her how to end the show function and do the same to the tdd that went off once the power was back. She called us back and confirmed she was able to end the show function and the device is working properly.", "serial_number": "GOKMOESTTDD2006572", "error_code": "TDD-NETSUPPORT"}}, {"pk": 312985, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208011, "date": "2017-09-07", "report": "Madam Kezia 724160157, called in regards to this device which was asking for net support activation, I asked the teacher if she had a smart phone which was loaded with bundles, she had a smart phone so I took her through the setting to set up the hot spot from her phone and then connect the Wi-Fi to the TDD. She launched the net support and activated the licenses, the net support worked properly.", "serial_number": "gokmoesttdd2005593", "error_code": "TDD-NETSUPPORT-ACTIVATION"}}, {"pk": 312985, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208011, "date": "2017-09-07", "report": "Madam Kezia 724160157, called in regards to this device which was asking for net support activation, I asked the teacher if she had a smart phone which was loaded with bundles, she had a smart phone so I took her through the setting to set up the hot spot from her phone and then connect the Wi-Fi to the TDD. She launched the net support and activated the licenses, the net support worked properly.", "serial_number": "gokmoesttdd2005593", "error_code": "TDD-NETSUPPORT-ACTIVATION"}}, {"pk": 342941, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207763, "date": "2017-09-07", "report": "Teacher Emma called that she could see an inverted image when she tried projecting using this device . I took her through the procedure of rectifying the image and she was able to. Issue resolved.", "serial_number": "q72g709aaaaac1215", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 342941, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207763, "date": "2017-09-07", "report": "Teacher Emma called that she could see an inverted image when she tried projecting using this device . I took her through the procedure of rectifying the image and she was able to. Issue resolved.", "serial_number": "q72g709aaaaac1215", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 156466, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207769, "date": "2017-09-13", "report": "\"Teacher Njuguna (773806713) called concerned about this device  not displaying contents from his TDD.I took him through the process of setting duplicate screen and he was now able to view the Tdd's content on the projector thus issue solved.", "serial_number": "Q72G709AAAAAC1234", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 156466, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207769, "date": "2017-09-13", "report": "\"Teacher Njuguna (773806713) called concerned about this device  not displaying contents from his TDD.I took him through the process of setting duplicate screen and he was now able to view the Tdd's content on the projector thus issue solved.", "serial_number": "Q72G709AAAAAC1234", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 156466, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207769, "date": "2017-09-13", "report": "\"Teacher Njuguna (773806713) called concerned about this device  not displaying contents from his TDD.I took him through the process of setting duplicate screen and he was now able to view the Tdd's content on the projector thus issue solved.", "serial_number": "Q72G709AAAAAC1234", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 909792, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208070, "date": "2017-06-29", "report": "Teacher Oliver 715627552 called concerning a projector that had foreign language and an inverted image.When troubleshooting the problem,unfortunately the power disconnected.The teacher promised to call us back when the power is back. Teacher Oliver 715627552 later called back and I took her through the procedure of changing the language to English and changing the inverted image to upright image and she was able to. Issue resolved", "serial_number": "Q72G644AAAAAC0334", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 243593, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 208126, "date": "2017-09-07", "report": "Mr. Kariuki called concerned that he was unable to use the send and collect function on this device . I advised him to connect this device and one LDD to the CAP network and he was able to. I then advised him to launch the net support and took him through the procedure of sending and collecting work and it worked", "serial_number": "GOKMOESTtDD2012305", "error_code": "TDD-NETSUPPORT"}}, {"pk": 322135, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221619, "date": "2017-05-24", "report": "TDD- HANGING Teacher Elizabeth 0713162529 called concerned that she was unable to sign in using this device. I advised her to cold boot the device by long pressing on the device until it shuts down then power it back on. I then advised her to sign in using the teachers account and it worked. Issue resolved.", "serial_number": "GOKMOESTTDD1001554", "error_code": "TDD - HANGING"}}, {"pk": 868371, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221684, "date": "2017-05-23", "report": "Mr Richard 721948960 called us today in regards to this device, where he wanted to connect the device to the cap network. I advised him to power on the device and power on the cap. He confirmed that both devices were powered on, so i told him to click on the notification area where he connected the device to the cap network and he was able to see the yellow triangle on the WiFi icon. He took one of the ldd and connected it and he launched the net support and he was able to register the student. Issue Resolved", "serial_number": "gokmoesttdd1001534", "error_code": "TDD-NETWORK"}}, {"pk": 809977, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221684, "date": "2017-05-25", "report": "Mr Richard 721948960 called us today in regards to this device, where he wanted to be taught how to use the show function. I advised him to power on the cap and the TDD, which he confirmed that he had powered on and connected the devices also registered four ldds. I advised him to move that cursor to the toolbar and click show function and choose show your desktop to all student and he was able to show mathematics content and I also taught him how to end the show function. The teacher was able to use the show function and end it properly. Issue resolved.", "serial_number": "gokmoesttdd1001534", "error_code": "TDD - NETSUPPORT"}}, {"pk": 741613, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221538, "date": "2017-03-21", "report": "Teacher Rosemary called us today to report that the projector was giving a very small display screen. I advised her to zoom the projector to the maximum, move the projector further backwards then use the keystones buttons to increase the display more. She was successful n the process. Problem solved", "serial_number": "Q72G646AAAAAC0377", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 892273, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221538, "date": "2017-03-21", "report": "TDD- NET SUPPORT. Madam Rosemary 07388945104 called concerned that this device was not connecting to the internet. She confirmed that she could see a yellow triangle on the WIFI icon which indicated that the device was connected to the CAP network. I advised her that the CAP only provides network but not internet and that she is able to conduct a class since the device is already connected to the CAP network. She also wanted to know how to register students using the net support and I took her through the priocedure and it worked. Issue resolved", "serial_number": "GOKMOESTTDD2001025", "error_code": "TDD - NETSUPPORT"}}, {"pk": 508263, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221567, "date": "2017-03-16", "report": "LDD NETWORK CONNECTION Mr. Patrick called with a concerned that the CAP was not providing Network. He explained that they were using the devices well in another room and the CAP network was okay but when they moved from that room to another, the CAP Network stopped responding. I took him through the procedure of connecting this device to the CAP Network by advising him to go to the notification area click on the Network icon then connect to the CAP Network. After following the procedure the device was connected. I advised him to follow the same procedure to connect the rest of the devices. PROBLEM SOLVED.  PROBLEM SOLVED.", "serial_number": "GOKMOESTLDD2086792", "error_code": "LDD-NETWORK"}}, {"pk": 269042, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221559, "date": "2017-05-19", "report": "Teacher Lilian 722875924 called in regards to this device where she wanted to register the student on the net support. I advised the teacher to power on the cap and the TDD, she confirmed that both were powered on. I advised her to go to the notification area and connect the TDD to the cap network, which she did and took one of the ldd and connected it to the cap network. After that i advised her to launch the net support and she was able to see the  student then she registered the student successful. Issue resolved.", "serial_number": "gokmoesttdd2000992", "error_code": "TDD - NETSUPPORT"}}, {"pk": 923880, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221559, "date": "2017-05-19", "report": "Teacher Lilian 722875924 called in regards to this device that was not showing the desktop icons but showing the cursor only.I advised her to cold reboot the device thus it was able to respond and the desktop icons were now visible.", "serial_number": "GOKMOESTTDD2000992", "error_code": "TDD - HANGING"}}, {"pk": 655688, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221628, "date": "2017-06-12", "report": "TDD- NETWORK Mr Wakaro 0721516235 called concerned that he was unable to connect this device to the CAP network. He handed the phone to Mr David who confirmed that he could see the yellow triangle with an exclamation mark inside which indicates that this device was already connected to the CAP network. Issue resolved.", "serial_number": "GOKMOESTTDD2001157", "error_code": "TDD-NETWORK"}}, {"pk": 247730, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221628, "date": "2017-06-12", "report": "Mr Isack- 0716391193 called concerned that he was unable to connect this device to the CAP network.I took him through the connection  process which he confirmed by seeing an exclamation mark inside which indicates that this device was already connected to the CAP network.", "serial_number": "GOKMOESTTDD2001157", "error_code": "TDD-NETWORK"}}, {"pk": 867726, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221623, "date": "2017-06-02", "report": "Mr John called 717579336 in regards to this device which was asking for an administrator password. I advised him to always use the teachers account while signing in on to the TDD and also use the student account when signing in to the LDD,  and upon signing in he was able to get into the desktop icons, device worked properly.", "serial_number": "gokmoesttdd2001109", "error_code": "TDD-DISPLAY"}}, {"pk": 73824, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221696, "date": "2017-05-23", "report": "TDD- HANGING Madam Vivian 0720771857 called concerned that this device was hanging. I advised her to cold boot the device by long pressing on the power button until it shuts down then power it back on. I then advised her to play a content from the desktop but the content could not show any images. I then took her through the procedure of connecting the device to the CAP network and advised her launch the connect server AP and play a content and it worked.", "serial_number": "GOKMOESTTDD2005968", "error_code": "TDD - HANGING"}}, {"pk": 557226, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221696, "date": "2017-05-23", "report": "TDD- NET SUPPORT Madam Vivian 0720771857 called concerned that she was unable to connect the LDDS to the TDD using the net support and also register students. I advised her to power on the CAP, an LDD and this device. I then took her through the procedure of connecting the LDD and TDD to the CAP network. I then advised her to launch the net support and she was able to see the connected student. I also showed her how to register students and she was able to.", "serial_number": "GOKMOESTTDD2005810", "error_code": "TDD-NETWORK"}}, {"pk": 377894, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221558, "date": "2017-07-17", "report": "Teacher Viola (724963155)called concerned about this device requesting for net support activation.I took her through the process of phone portable wifi tethering and the connecting the Tdd to the phone's portable wifi but it could not connect even after trying to cold boot.I therefore advised her to try get another smartphone and call us back.On calling her back she confirmed that she was able to activate the netsupport thus issue sorted.", "serial_number": "GOKMOESTTDD2007057", "error_code": "TDD-NETSUPPORT-ACTIVATION"}}, {"pk": 687851, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221555, "date": "2017-06-29", "report": "Teacher Tabitha 726114945 called us today in regards to this device which she was not able to connect the ldd and see them on the net support. I advised the teacher to power on the cap and connect the TDD and the LDD to the cap network. Then launch the net support and the teacher was able to see the connected devices on the net support issue resolved.", "serial_number": "GOKMOESTTDD2005214", "error_code": "TDD-NETSUPPORT"}}, {"pk": 343439, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221555, "date": "2017-07-05", "report": "Teacher Tabitha (717069449) called concerned about this device that was hanging on the sign in.I took her through the process of cold booting and the problem was solved.", "serial_number": "GOKMOESTTDD2006159", "error_code": "TDD-HANGING"}}, {"pk": 452594, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221569, "date": "2017-07-06", "report": "Teacher Milka called  concerned about connecting devices to the CAP and then registering the students.I took her through the process of connecting to the cap and registering the connected student thus resolved.I therefore advised her to to the same on the other LDDs and register them on the net support", "serial_number": "GOKMOESTLDD2104942", "error_code": "LDD-NETWORK"}}, {"pk": 117360, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221569, "date": "2017-07-06", "report": "Teacher Milka called  concerned about connecting devices to the CAP and then registering the students.I took her through the process of connecting to the cap and registering the connected student thus resolved.I therefore advised her to to the same on the other LDDs and register them on the net support", "serial_number": "GOKMOESTTDD2007020", "error_code": "TDD-NETWORK"}}, {"pk": 762976, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221595, "date": "2017-07-07", "report": "Madam Ruth 723499566 called in regards to this device  which she could not get the same projected content on the white board side. I advised her to go to the notification area  of the TDD and choose project then click on the duplicate. She was able to see the same content projected on the white board. Issue resolved.", "serial_number": "q72g647aaaaac0558", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 46614, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 221599, "date": "2017-07-03", "report": "LDD- NET SUPPORT Teacher Ruth 722778944 called concerned that she was unable to register this device on the net support school on the TDD. I took her through the procedure of connecting this device to the CAP network and she was able to. I showed her how to register this device using the net support school on the TDD and she was able to.", "serial_number": "GOKMOESTldd2094999", "error_code": "LDD-NETSUPPORT"}}, {"pk": 896532, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212732, "date": "2017-02-07", "report": "TDD NETWORK CONNECTION Elizabeth called to be assisted on how to connect the devices to the CAP Network, I was able to assist him to connect this device by advising him to select the Network icon on the notification area and connect to the CAP Network. PROBLEM SOLVED", "serial_number": "GOKMOESTTDD1001402", "error_code": "TDD - SOFTWARE"}}, {"pk": 610379, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212732, "date": "2017-02-07", "report": "LDD NETWORK CONNECTION Elizabeth called to be assisted on how to connect the devices to the CAP Network, I was able to assist him to connect this device by advising him to select the Network icon on the notification area and connect to the CAP Network. PROBLEM SOLVED", "serial_number": "GOKMOESTLDD1165422", "error_code": "LDD - SOFTWARE"}}, {"pk": 417287, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212441, "date": "2017-07-17", "report": "LDD- AUTOMATIC REPAIR Mr James 720479882 called concerned that this device had error 'automatic repair restart your PC' when he powered on the device. I advised him to power it on but it could not power on. I advised him to connect this device to a working charger and h could see a red LED light. He promised to call us back at 11.am when the device is charged so that we could finish troubleshooting. Mr James 720479882 later called back to inform us that he was able to power on the device and that the device was now working well.", "serial_number": "gokmoestldd2167965", "error_code": "LDD-IMAGE"}}, {"pk": 258093, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-04-10", "report": "Mr. Peter-0727456664 from Gitare Primary School in Nakuru County called to be assisted on how he can locate the Keyboard on this device.I asked the teacher to confirm if the device was on Tablet mode which he confirmed not to be. I advised him to long press on the notification area then click on the show touch keyboard button which he did successful and he was able to view the keyboard Problem solved", "serial_number": "GOKMOESTLDD2151716", "error_code": "LDD - SOFTWARE"}}, {"pk": 137174, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-04-10", "report": "Mr Peter 727456664 called us today in regards to this device which he could not sign in as a teacher  I advised him to long press on the power button for a five seconds and power on the device, he was able to sign in as a teacher and the see the desktop icons. Issue resolved.", "serial_number": "GOKMOESTTDD2011664", "error_code": "TDD - HANGING"}}, {"pk": 893415, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-04-10", "report": "Mr. Peter (0715474118) called to report that he could only get sound but no image from the projector (Q72G646AAAAAC0734). I advised him to press on the FN key and the F5 key simultaneously then select duplicate on the TDD. After that procedure he confirmed to get both the image and sound. Problem solved.", "serial_number": "Q72G646AAAAAC0734", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 72644, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-06-12", "report": "Teacher Peter- 0729847104 called concerned about  this device  not displaying  the TDD content.I advised him to press on the FN key and the F5 key simultaneously then select duplicate on the TDD. After that procedure he confirmed he was now able to view the content.", "serial_number": "Q72G646AAAAAC0734", "error_code": "PROJECTOR CONNECTION"}}, {"pk": 925084, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-06-19", "report": "Teacher Peter (0727456664)called concerned about this device having a blank screen.I advised him to cold boot the device and the device was now working properly thus solved.", "serial_number": "GOKMOESTLDD2147874", "error_code": "LDD-DISPLAY"}}, {"pk": 258093, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-04-10", "report": "Mr. Peter-0727456664 from Gitare Primary School in Nakuru County called to be assisted on how he can locate the Keyboard on this device.I asked the teacher to confirm if the device was on Tablet mode which he confirmed not to be. I advised him to long press on the notification area then click on the show touch keyboard button which he did successful and he was able to view the keyboard Problem solved", "serial_number": "GOKMOESTLDD2151716", "error_code": "LDD - SOFTWARE"}}, {"pk": 137174, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-04-10", "report": "Mr Peter 727456664 called us today in regards to this device which he could not sign in as a teacher  I advised him to long press on the power button for a five seconds and power on the device, he was able to sign in as a teacher and the see the desktop icons. Issue resolved.", "serial_number": "GOKMOESTTDD2011664", "error_code": "TDD - HANGING"}}, {"pk": 893415, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-04-10", "report": "Mr. Peter (0715474118) called to report that he could only get sound but no image from the projector (Q72G646AAAAAC0734). I advised him to press on the FN key and the F5 key simultaneously then select duplicate on the TDD. After that procedure he confirmed to get both the image and sound. Problem solved.", "serial_number": "Q72G646AAAAAC0734", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 72644, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-06-12", "report": "Teacher Peter- 0729847104 called concerned about  this device  not displaying  the TDD content.I advised him to press on the FN key and the F5 key simultaneously then select duplicate on the TDD. After that procedure he confirmed he was now able to view the content.", "serial_number": "Q72G646AAAAAC0734", "error_code": "PROJECTOR CONNECTION"}}, {"pk": 925084, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-06-19", "report": "Teacher Peter (0727456664)called concerned about this device having a blank screen.I advised him to cold boot the device and the device was now working properly thus solved.", "serial_number": "GOKMOESTLDD2147874", "error_code": "LDD-DISPLAY"}}, {"pk": 258093, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-04-10", "report": "Mr. Peter-0727456664 from Gitare Primary School in Nakuru County called to be assisted on how he can locate the Keyboard on this device.I asked the teacher to confirm if the device was on Tablet mode which he confirmed not to be. I advised him to long press on the notification area then click on the show touch keyboard button which he did successful and he was able to view the keyboard Problem solved", "serial_number": "GOKMOESTLDD2151716", "error_code": "LDD - SOFTWARE"}}, {"pk": 137174, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-04-10", "report": "Mr Peter 727456664 called us today in regards to this device which he could not sign in as a teacher  I advised him to long press on the power button for a five seconds and power on the device, he was able to sign in as a teacher and the see the desktop icons. Issue resolved.", "serial_number": "GOKMOESTTDD2011664", "error_code": "TDD - HANGING"}}, {"pk": 893415, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-04-10", "report": "Mr. Peter (0715474118) called to report that he could only get sound but no image from the projector (Q72G646AAAAAC0734). I advised him to press on the FN key and the F5 key simultaneously then select duplicate on the TDD. After that procedure he confirmed to get both the image and sound. Problem solved.", "serial_number": "Q72G646AAAAAC0734", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 72644, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-06-12", "report": "Teacher Peter- 0729847104 called concerned about  this device  not displaying  the TDD content.I advised him to press on the FN key and the F5 key simultaneously then select duplicate on the TDD. After that procedure he confirmed he was now able to view the content.", "serial_number": "Q72G646AAAAAC0734", "error_code": "PROJECTOR CONNECTION"}}, {"pk": 925084, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-06-19", "report": "Teacher Peter (0727456664)called concerned about this device having a blank screen.I advised him to cold boot the device and the device was now working properly thus solved.", "serial_number": "GOKMOESTLDD2147874", "error_code": "LDD-DISPLAY"}}, {"pk": 258093, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-04-10", "report": "Mr. Peter-0727456664 from Gitare Primary School in Nakuru County called to be assisted on how he can locate the Keyboard on this device.I asked the teacher to confirm if the device was on Tablet mode which he confirmed not to be. I advised him to long press on the notification area then click on the show touch keyboard button which he did successful and he was able to view the keyboard Problem solved", "serial_number": "GOKMOESTLDD2151716", "error_code": "LDD - SOFTWARE"}}, {"pk": 137174, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-04-10", "report": "Mr Peter 727456664 called us today in regards to this device which he could not sign in as a teacher  I advised him to long press on the power button for a five seconds and power on the device, he was able to sign in as a teacher and the see the desktop icons. Issue resolved.", "serial_number": "GOKMOESTTDD2011664", "error_code": "TDD - HANGING"}}, {"pk": 893415, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-04-10", "report": "Mr. Peter (0715474118) called to report that he could only get sound but no image from the projector (Q72G646AAAAAC0734). I advised him to press on the FN key and the F5 key simultaneously then select duplicate on the TDD. After that procedure he confirmed to get both the image and sound. Problem solved.", "serial_number": "Q72G646AAAAAC0734", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 72644, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-06-12", "report": "Teacher Peter- 0729847104 called concerned about  this device  not displaying  the TDD content.I advised him to press on the FN key and the F5 key simultaneously then select duplicate on the TDD. After that procedure he confirmed he was now able to view the content.", "serial_number": "Q72G646AAAAAC0734", "error_code": "PROJECTOR CONNECTION"}}, {"pk": 925084, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-06-19", "report": "Teacher Peter (0727456664)called concerned about this device having a blank screen.I advised him to cold boot the device and the device was now working properly thus solved.", "serial_number": "GOKMOESTLDD2147874", "error_code": "LDD-DISPLAY"}}, {"pk": 258093, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-04-10", "report": "Mr. Peter-0727456664 from Gitare Primary School in Nakuru County called to be assisted on how he can locate the Keyboard on this device.I asked the teacher to confirm if the device was on Tablet mode which he confirmed not to be. I advised him to long press on the notification area then click on the show touch keyboard button which he did successful and he was able to view the keyboard Problem solved", "serial_number": "GOKMOESTLDD2151716", "error_code": "LDD - SOFTWARE"}}, {"pk": 137174, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-04-10", "report": "Mr Peter 727456664 called us today in regards to this device which he could not sign in as a teacher  I advised him to long press on the power button for a five seconds and power on the device, he was able to sign in as a teacher and the see the desktop icons. Issue resolved.", "serial_number": "GOKMOESTTDD2011664", "error_code": "TDD - HANGING"}}, {"pk": 893415, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-04-10", "report": "Mr. Peter (0715474118) called to report that he could only get sound but no image from the projector (Q72G646AAAAAC0734). I advised him to press on the FN key and the F5 key simultaneously then select duplicate on the TDD. After that procedure he confirmed to get both the image and sound. Problem solved.", "serial_number": "Q72G646AAAAAC0734", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 72644, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-06-12", "report": "Teacher Peter- 0729847104 called concerned about  this device  not displaying  the TDD content.I advised him to press on the FN key and the F5 key simultaneously then select duplicate on the TDD. After that procedure he confirmed he was now able to view the content.", "serial_number": "Q72G646AAAAAC0734", "error_code": "PROJECTOR CONNECTION"}}, {"pk": 925084, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202959, "date": "2017-06-19", "report": "Teacher Peter (0727456664)called concerned about this device having a blank screen.I advised him to cold boot the device and the device was now working properly thus solved.", "serial_number": "GOKMOESTLDD2147874", "error_code": "LDD-DISPLAY"}}, {"pk": 952170, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 200812, "date": "2017-08-31", "report": "Teacher Edwin (0715143743) called concerned about this device not responding to teachers sign .I took him through the process of cold booting thus the issue resolved.", "serial_number": "GOKMOESTTDD2013688", "error_code": "TDD-HANGING"}}, {"pk": 952170, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 200812, "date": "2017-08-31", "report": "Teacher Edwin (0715143743) called concerned about this device not responding to teachers sign .I took him through the process of cold booting thus the issue resolved.", "serial_number": "GOKMOESTTDD2013688", "error_code": "TDD-HANGING"}}, {"pk": 952170, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 200812, "date": "2017-08-31", "report": "Teacher Edwin (0715143743) called concerned about this device not responding to teachers sign .I took him through the process of cold booting thus the issue resolved.", "serial_number": "GOKMOESTTDD2013688", "error_code": "TDD-HANGING"}}, {"pk": 952170, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 200812, "date": "2017-08-31", "report": "Teacher Edwin (0715143743) called concerned about this device not responding to teachers sign .I took him through the process of cold booting thus the issue resolved.", "serial_number": "GOKMOESTTDD2013688", "error_code": "TDD-HANGING"}}, {"pk": 952170, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 200812, "date": "2017-08-31", "report": "Teacher Edwin (0715143743) called concerned about this device not responding to teachers sign .I took him through the process of cold booting thus the issue resolved.", "serial_number": "GOKMOESTTDD2013688", "error_code": "TDD-HANGING"}}, {"pk": 911035, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206835, "date": "2017-03-28", "report": "TDD USER LOG IN Sera- 720866184 from Nyakiambi Primary in Nakuru County called to be assisted on how she can sign in on this device  I asked her to tell me what she can see after powering on the device. She explained she can see the teacher’s account and the Administrator’s account. I advised her to click on the teacher’s account which she said it was not responding. I told her to cold reboot and try to log in again. After following the procedure the device responded and she was able to log in with the teacher’s account PROBLEM SOLVED", "serial_number": "GOKMOESTTDD2003930", "error_code": "TDD - SOFTWARE"}}, {"pk": 911035, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206835, "date": "2017-03-28", "report": "TDD USER LOG IN Sera- 720866184 from Nyakiambi Primary in Nakuru County called to be assisted on how she can sign in on this device  I asked her to tell me what she can see after powering on the device. She explained she can see the teacher’s account and the Administrator’s account. I advised her to click on the teacher’s account which she said it was not responding. I told her to cold reboot and try to log in again. After following the procedure the device responded and she was able to log in with the teacher’s account PROBLEM SOLVED", "serial_number": "GOKMOESTTDD2003930", "error_code": "TDD - SOFTWARE"}}, {"pk": 677608, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212704, "date": "2017-03-28", "report": "TDD NET SUPPORT NAVIGATION  Emily -0720987497 from KapSorok Primary School in Nakuru County called to be assisted on how she can register the students on Net Support. I was able to take her through the process and she promised to call back for more assistance on Net Support.", "serial_number": "GOKMOESTTDD2003936", "error_code": "TDD - NETSUPPORT"}}, {"pk": 283092, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212704, "date": "2017-05-15", "report": "NET-SUPPORT NAVIGATION-Madam Emily(721709318) called for assistance on net support navigation where by she could not be able to use the show function when teaching,i took her through the procedure of connecting the GOKMOESTLDD2060003 to the CAP network so we could use it for the show function,after troubleshooting she could not be able to see the content on her desktop because her device was on tablet mode.i took her through the process of deactivating it and she could be able to choose class one social studies through the show function.she also confirmed after launching the show menu on the ldd,it produced some noise and we were able to control the sound via the access controls on the net support.Issue Resolved.", "serial_number": "GOKMOESTTDD2003936", "error_code": "TDD - NETSUPPORT"}}, {"pk": 173050, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212704, "date": "2017-05-16", "report": "Madam Emily(721709318) called concerned about the device producing an echo sound while using the show function on the net support.I therefore advised to click on the headset icon and mute the microphone sound thus resolved.", "serial_number": "GOKMOESTTDD2003936", "error_code": "TDD - NETSUPPORT"}}, {"pk": 572108, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212704, "date": "2017-05-16", "report": "Teacher Emily (721709318) called today to report that she could not show her desktop to this device using net support. I assisted her in disconnecting the device from airplane mode and connecting it to the CAP network. After that I advised her to try blanking the device and she was able to do that.", "serial_number": "GOKMOESTLDD2061864", "error_code": "LDD-NETWORK"}}, {"pk": 119607, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212704, "date": "2017-05-16", "report": "Teacher Emily (721709318) called today to report that she could not show her desktop to this device using net support. I assisted her in disconnecting the device from airplane mode and connecting it to the CAP network. After that I advised her to try blanking the device and she was able to do that.", "serial_number": "GOKMOESTLDD2050454", "error_code": "LDD-NETWORK"}}, {"pk": 450049, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212704, "date": "2017-05-16", "report": "Teacher Emily (721709318) called today to report that she could not show her desktop to this device using net support. I assisted her in disconnecting the device from airplane mode and connecting it to the CAP network. After that I advised her to try blanking the device and she was able to do that.", "serial_number": "GOKMOESTLDD2060050", "error_code": "LDD-NETWORK"}}, {"pk": 417713, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212704, "date": "2017-05-16", "report": "Teacher Emily (721709318) called today to report that she could not show her desktop to this device using net support. I assisted her in disconnecting the device from airplane mode and connecting it to the CAP network. After that I advised her to try blanking the device and she was able to do that.", "serial_number": "GOKMOESTLDD2064504", "error_code": "LDD-NETWORK"}}, {"pk": 107745, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212704, "date": "2017-05-16", "report": "Teacher Emily (721709318) called today to report that she could not show her desktop to this device using net support. I assisted her in disconnecting the device from airplane mode and connecting it to the CAP network. After that I advised her to try blanking the device and she was able to do that.", "serial_number": "GOKMOESTLDD2073951", "error_code": "LDD-NETWORK"}}, {"pk": 547065, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212704, "date": "2017-05-16", "report": "Teacher Emily (721709318) called today to report that she could not show her desktop to this device using net support. I assisted her in disconnecting the device from airplane mode and connecting it to the CAP network. After that I advised her to try blanking the device and she was able to do that.", "serial_number": "GOKMOESTLDD2061382", "error_code": "LDD-NETWORK"}}, {"pk": 363161, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212704, "date": "2017-05-16", "report": "TDD- CONTENT Teacher Emily(721709318) called concerned that this device could not show subtopics. I advised her to use the connect server AP and open the English content for class 1 and the phone got disconnected before we could troubleshoot. Madam Caroline later called concerned that the content in this device was too shallow, I advised her to always use the updated content from the CAP. I took her through the process of accessing the CAP content and it worked.", "serial_number": "gokmoesttdd2003936", "error_code": "TDD - CONTENT"}}, {"pk": 58605, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212704, "date": "2017-07-19", "report": "Madam Emily 0721709318 called concerned that the LDDS were producing an echo when she played a content using the show function. I advised her to launch the net support and as I was taking her through the process of disabling the microphone the call got disconnected.She called back and i took her through the process of muting the microphone thus issue solved.", "serial_number": "GOKMOESTTDD2003521", "error_code": "TDD-NETSUPPORT"}}, {"pk": 582336, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212740, "date": "2017-03-28", "report": "Mr. Peter (0723466204) from Longot D.E.B in Nakuru County called to inform us that the CAP was disconnecting this device. I asked him to confirm to me how the network icon looked like and he explained that it had a yellow triangle with an exclamation mark. I assured him that the TDD was connected and that every time he sees that icon he should know that the TDD is connected. He also wanted to get assistance on how to control students using net support. I advised him to get at least 2 LDDs then call back for more assistance.", "serial_number": "GOKMOESTTDD2003595", "error_code": "TDD-NETWORK"}}, {"pk": 837265, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202416, "date": "2017-04-01", "report": "TDD- NETWORK Madam Perpetua 0725872657 called concerned that she was unable to connect this device to the CAP network. I advised her to locate the WiFi icon and she confirmed that she could see a yellow triangle with an exclamation mark. I assured her that the device is already connected to the Cap network and that she can continue using the device. Problem solved.", "serial_number": "GOKMOESTTDD2003782", "error_code": "TDD-NETWORK"}}, {"pk": 837265, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202416, "date": "2017-04-01", "report": "TDD- NETWORK Madam Perpetua 0725872657 called concerned that she was unable to connect this device to the CAP network. I advised her to locate the WiFi icon and she confirmed that she could see a yellow triangle with an exclamation mark. I assured her that the device is already connected to the Cap network and that she can continue using the device. Problem solved.", "serial_number": "GOKMOESTTDD2003782", "error_code": "TDD-NETWORK"}}, {"pk": 952170, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212785, "date": "2017-08-31", "report": "Teacher Edwin (0715143743) called concerned about this device not responding to teachers sign .I took him through the process of cold booting thus the issue resolved.", "serial_number": "GOKMOESTTDD2013688", "error_code": "TDD-HANGING"}}, {"pk": 952170, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212785, "date": "2017-08-31", "report": "Teacher Edwin (0715143743) called concerned about this device not responding to teachers sign .I took him through the process of cold booting thus the issue resolved.", "serial_number": "GOKMOESTTDD2013688", "error_code": "TDD-HANGING"}}, {"pk": 952170, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212785, "date": "2017-08-31", "report": "Teacher Edwin (0715143743) called concerned about this device not responding to teachers sign .I took him through the process of cold booting thus the issue resolved.", "serial_number": "GOKMOESTTDD2013688", "error_code": "TDD-HANGING"}}, {"pk": 952170, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212785, "date": "2017-08-31", "report": "Teacher Edwin (0715143743) called concerned about this device not responding to teachers sign .I took him through the process of cold booting thus the issue resolved.", "serial_number": "GOKMOESTTDD2013688", "error_code": "TDD-HANGING"}}, {"pk": 952170, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 212785, "date": "2017-08-31", "report": "Teacher Edwin (0715143743) called concerned about this device not responding to teachers sign .I took him through the process of cold booting thus the issue resolved.", "serial_number": "GOKMOESTTDD2013688", "error_code": "TDD-HANGING"}}, {"pk": 126840, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206873, "date": "2017-02-02", "report": "PROJECTOR SOUND Mr. John called to inform us that he was not getting sound from the TDD and projector connection. I advised him to check the volume percentage on the TDD notification and he confirmed that it was at 100%. I realized he was using the VGA cable and so I advised him to use the HDMI cable. After connecting using the HDMI cable he was able to get sound.", "serial_number": "wd4k6700503", "error_code": "PROJECTOR- SOUND"}}, {"pk": 600909, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206873, "date": "2017-02-02", "report": "TDD-CAP NETWORK CONNECTION Mr. John called to inform us he was unable to connect this device to the CAP network. I advised him to go to the notification area and connect the TDD to the CAP network. After that I advised him to open the connect server AP to confirm whether he could access the CAP content. I successfully assisted him", "serial_number": "gokmoesttdd1000416", "error_code": "TDD - SOFTWARE"}}, {"pk": 698774, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206873, "date": "2017-02-16", "report": "TDD-CAP NETWORK CONNECTION Madam Esther called for assistance on how to open the KICD content direct from the CAP. I advised her to open the action center,go to settings and then select connect automatically to the connect server AP. After that i advised her to select the connect server AP on the desktop to get the CAP content. She also inquired about how to open the Tusome content. I guided her through and she was able to open it. Problem solved", "serial_number": "gokmoesttdd1000416", "error_code": "TDD - SOFTWARE"}}, {"pk": 937301, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206900, "date": "2017-03-20", "report": "Teacher Agnes (07109829280 called concerned on how to register the students.I took her through the process of connecting to the cap then launching net support followed by registering the students.", "serial_number": "GOKMOESTTDD2001063", "error_code": "TDD - NETSUPPORT"}}, {"pk": 91817, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206900, "date": "2017-03-20", "report": "Teacher Agnes (07109829280 called concerned on how to connect the ldd to the cap.I took her through the action center-go to settings-then select the content server ap then connect automatically.She was able to connect the ldd to the cap", "serial_number": "GOKMOESTLDD2064206", "error_code": "LDD-NETWORK"}}, {"pk": 345705, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206859, "date": "2017-01-18", "report": "Teacher Jane (720289277) called in regards to previous issue she had with one of the school's TDD that had  'E90043' Error on both sides of the screen and was asking for an administrator password . She said that the TDD is currently working well and no longer has that problem. I thanked her for notifying us and asked her to call in-case the same problem arises", "serial_number": "GOKMOESTTDD2000817", "error_code": "TDD - SOFTWARE"}}, {"pk": 887035, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206859, "date": "2017-01-28", "report": "SHOW FUNCTION/SEND AND COLLECT WORK Madam Jane (720289277) from Huho-ini primary school in Nyandarua County called for assistance on how to use show function and send and collect work function. She also said that she could not see the subtitles after opening a content. I advised her to open the content via the connect server AP and zoom in to 75% for her to see the content and the subtitles. I also assisted her with the show function problem but was not able to take her through the send and collect function because she had no content saved in the TDD to use. We agreed that she would set some work and save it then call for more assistance. She later called and I was able to take her through the send and collect function and she was fully assisted.", "serial_number": "GOKMOESTTDD2000817", "error_code": "TDD - NETSUPPORT"}}, {"pk": 897756, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206859, "date": "2017-03-16", "report": "TDD NOT PLAYING SCIENCE CONTENT Jane -720289277 called concerned that this device was not playing the science content. I advised her to use the content from the CAP or use the connect serve AP which is on the desktop. She later explained that she had not connected this device to the CAP Network. I advised her to always ensure that she has connected this device to the CAP Network in order to access the updated content", "serial_number": "GOKMOESTTDD2000817", "error_code": "TDD - CONTENT"}}, {"pk": 412844, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206945, "date": "2017-02-27", "report": "NET SUPPORT ACTIVATION Teacher Gitau(0715296582) called concerned  about is device requesting for net support activation.I therefore took him through the process of tethering and portable wifi then activating the net support  online .The net support  was activated as confirmed by the teacher who was now able to launch the netsupport", "serial_number": "GOKMOESTTDD2000423", "error_code": "TDD - NETSUPPORT"}}, {"pk": 198991, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207042, "date": "2017-02-28", "report": "TDD NOT DISPLAYING THE DESKTOP. Teacher Peter called us today in regards to this device which was not showing him the desktop icons. I advised him to cold reboot the device by pressing the power button for 5 seconds and the device powered off and after powering it on, he was able to see all the desktop icons and it was working properly. Issue Resolved.", "serial_number": "gokmoesttdd2002317", "error_code": "TDD - SOFTWARE"}}, {"pk": 654730, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207042, "date": "2017-03-17", "report": "Mr. Peter- 726442447  called to report this device which he explained he could not see the students on the Net Support. On launching the Net support I discovered they were using class 3 instead of room 3.Mr.peter said another teacher renamed the rooms. I took him through the process of renaming the rooms to its original and we selecting the right room where the LDD were registered. After following the procedure he was able to view the students on Net support. PROBLEM SOLVED", "serial_number": "GOKMOESTTDD2002317", "error_code": "TDD - NETSUPPORT"}}, {"pk": 28382, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207042, "date": "2017-05-16", "report": "Teacher Peter (707315683) called to report that he was unable to update the windows defender due to lack of internet in the CAP. I asked him to clear the notifications on action center and advised him that the CAP does not provide internet. He also informed me that he was unable to play a certain audio on windows media player. I told him the version of the file could be the issue and that we would send a technician to update it or add VLC player.", "serial_number": "GOKMOESTTDD2002317", "error_code": "TDD - SOFTWARE"}}, {"pk": 198991, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207042, "date": "2017-02-28", "report": "TDD NOT DISPLAYING THE DESKTOP. Teacher Peter called us today in regards to this device which was not showing him the desktop icons. I advised him to cold reboot the device by pressing the power button for 5 seconds and the device powered off and after powering it on, he was able to see all the desktop icons and it was working properly. Issue Resolved.", "serial_number": "gokmoesttdd2002317", "error_code": "TDD - SOFTWARE"}}, {"pk": 654730, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207042, "date": "2017-03-17", "report": "Mr. Peter- 726442447  called to report this device which he explained he could not see the students on the Net Support. On launching the Net support I discovered they were using class 3 instead of room 3.Mr.peter said another teacher renamed the rooms. I took him through the process of renaming the rooms to its original and we selecting the right room where the LDD were registered. After following the procedure he was able to view the students on Net support. PROBLEM SOLVED", "serial_number": "GOKMOESTTDD2002317", "error_code": "TDD - NETSUPPORT"}}, {"pk": 28382, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207042, "date": "2017-05-16", "report": "Teacher Peter (707315683) called to report that he was unable to update the windows defender due to lack of internet in the CAP. I asked him to clear the notifications on action center and advised him that the CAP does not provide internet. He also informed me that he was unable to play a certain audio on windows media player. I told him the version of the file could be the issue and that we would send a technician to update it or add VLC player.", "serial_number": "GOKMOESTTDD2002317", "error_code": "TDD - SOFTWARE"}}, {"pk": 840867, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207045, "date": "2017-06-20", "report": "Madam Beatrice called us today concerned about this device which was showing an automatic repair error code on the screen. I advised her to cold reboot the device and after powering on she was able to navigate through the device properly. Issue resolved.", "serial_number": "gokmoestldd2030288", "error_code": "LDD-IMAGE"}}, {"pk": 624082, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207045, "date": "2017-06-20", "report": "LDD- WHIZZING SOUND Madam Beatrice 0725947558 called concerned that this device was producing a whizzing sound. I advised her to cold boot the device by long pressing on the power button to shut it down then power it back on. I then advised her to play a content and she was able to. Issue resolved.", "serial_number": "GOKMOESTLDD2016133", "error_code": "LDD-SOUND"}}, {"pk": 516013, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206790, "date": "2017-07-18", "report": "Teacher James (724327560)called concerned about this device having a blue screen with the error message 'automatic repair'.I advised him to cold boot and the issue was thus sorted.", "serial_number": "GOKMOESTLDD2021994", "error_code": "LDD-IMAGE"}}, {"pk": 357757, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206790, "date": "2017-07-18", "report": "Teacher James (724327560)called concerned about this device having a blue screen with the error message 'automatic repair'.I advised him to cold boot and the issue was thus sorted.", "serial_number": "GOKMOESTLDD2023995", "error_code": "LDD-IMAGE"}}, {"pk": 706276, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206790, "date": "2017-07-18", "report": "Teacher James (724327560)called concerned about this device having a blue screen with the error message 'automatic repair'.I advised him to cold boot and the issue was thus sorted.", "serial_number": "GOKMOESTLDD2022903", "error_code": "LDD-IMAGE"}}, {"pk": 107105, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206790, "date": "2017-07-18", "report": "Teacher James (724327560)called concerned about this device having a blue screen with the error message 'automatic repair'.I advised him to cold boot and the issue was thus sorted.", "serial_number": "GOKMOESTLDD2011673", "error_code": "LDD-IMAGE"}}, {"pk": 98102, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206893, "date": "2017-03-30", "report": "PROJECTOR CONNECTION Mr Joseph 0724932536 called in regards to this device which was unable to project. I advised him to firmly connect the HDMI cable to both the TDD and the projector. I then advised him to click on the source button and select HDMI and he was able to see the projection from the TDD. I then advised him to play a content and he was able to get sound from the projector. Problem solved.", "serial_number": "q72g644aaaaac0051", "error_code": "PROJECTOR CONNECTION"}}, {"pk": 98102, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206893, "date": "2017-03-30", "report": "PROJECTOR CONNECTION Mr Joseph 0724932536 called in regards to this device which was unable to project. I advised him to firmly connect the HDMI cable to both the TDD and the projector. I then advised him to click on the source button and select HDMI and he was able to see the projection from the TDD. I then advised him to play a content and he was able to get sound from the projector. Problem solved.", "serial_number": "q72g644aaaaac0051", "error_code": "PROJECTOR CONNECTION"}}, {"pk": 680220, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206769, "date": "2017-07-18", "report": "Mr. Mwangi (799641601) called to inform us that he could see the desktop on the display but when he opened net support he could not see it on the projector display. I assisted him on how to change the projection mode from extend to duplicate and he was okay. Problem Resolved", "serial_number": "Q72G646AAAAAC2105", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 511046, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206815, "date": "2017-07-20", "report": "Teacher Rachael (723147180) called concerned about this  device producing whizzing sound.I took her through the process of cold booting and the problem was thus solved.", "serial_number": "GOKMOESTLDD2218254", "error_code": "LDD-SOUND"}}, {"pk": 507039, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206817, "date": "2017-07-07", "report": "Mr Richard called 739753860 called today in regards to this device which he could not get the Tusome content. I advised him to power on the cap and connect the tdd to the cap network. We then launched the Connect server AP folder and after loading the content he was able to open tusome content fro class one and the content opened well. Issue resolved.", "serial_number": "gokmoesttdd2013430", "error_code": "TDD-NETSUPPORT"}}, {"pk": 629634, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206830, "date": "2017-06-20", "report": "Mr Simon 728490703 called us today in regards to this device which was showing an error message of automatic repair. I advised him to cold reboot the device and after powering on the device the error message disappeared and the device worked properly.", "serial_number": "gokmoestldd2221262", "error_code": "LDD-AUTOMATIC-RESTART"}}, {"pk": 663150, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206885, "date": "2017-07-04", "report": "Teacher Nancy (0727934522) called concerned about this device not projecting Tdd's content.I took her through the Hdmi source selection but the issue persisted.I therefore advised her to use the VGA cable but since she could not locate it,she requested to call us back once she found the HDMI converter. We later called back and madam Nancy confirmed that she was able to make the connection and she could see projection on the white board.", "serial_number": "Q72G648AAAAAC1337", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 663150, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206885, "date": "2017-07-04", "report": "Teacher Nancy (0727934522) called concerned about this device not projecting Tdd's content.I took her through the Hdmi source selection but the issue persisted.I therefore advised her to use the VGA cable but since she could not locate it,she requested to call us back once she found the HDMI converter. We later called back and madam Nancy confirmed that she was able to make the connection and she could see projection on the white board.", "serial_number": "Q72G648AAAAAC1337", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 663150, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206885, "date": "2017-07-04", "report": "Teacher Nancy (0727934522) called concerned about this device not projecting Tdd's content.I took her through the Hdmi source selection but the issue persisted.I therefore advised her to use the VGA cable but since she could not locate it,she requested to call us back once she found the HDMI converter. We later called back and madam Nancy confirmed that she was able to make the connection and she could see projection on the white board.", "serial_number": "Q72G648AAAAAC1337", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 663150, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206885, "date": "2017-07-04", "report": "Teacher Nancy (0727934522) called concerned about this device not projecting Tdd's content.I took her through the Hdmi source selection but the issue persisted.I therefore advised her to use the VGA cable but since she could not locate it,she requested to call us back once she found the HDMI converter. We later called back and madam Nancy confirmed that she was able to make the connection and she could see projection on the white board.", "serial_number": "Q72G648AAAAAC1337", "error_code": "PROJECTOR-CONNECTION"}}, {"pk": 710218, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206991, "date": "2017-09-07", "report": "Mr Samuel called 724167767 us today in regards to this device which was not responding to touch. I advised him to cold boot the device and after powering on the device it worked well. Issue resolved.", "serial_number": "gokmoestldd2194825", "error_code": "LDD-TOUCH-SCREEN"}}, {"pk": 386945, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206991, "date": "2017-09-07", "report": "Mr. Samuel called 724167767 us today in regards to this device which was not powering on. I advised him to connect the device to a working charger and he was able to see a red led light but after long pressing on the power button for a while the device powered on. I told the teacher to let the device charge until full. Issue Resolved.", "serial_number": "gokmoestldd2194262", "error_code": "LDD-NOT-POWERING-ON"}}, {"pk": 452031, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206991, "date": "2017-09-07", "report": "Samuel called 724167767 us today in regards to this device which was not responding to touch. I advised him to cold boot the device and after powering on the device it worked well. Issue resolved.", "serial_number": "gokmoestldd2265097", "error_code": "LDD-TOUCH-SCREEN"}}, {"pk": 661394, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206991, "date": "2017-09-07", "report": "Samuel called 724167767 us today in regards to this device which was not responding to touch. I advised him to cold boot the device and after powering on the device it worked well. Issue resolved.", "serial_number": "gokmoestldd2259351", "error_code": "LDD-TOUCH-SCREEN"}}, {"pk": 773386, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207003, "date": "2017-07-19", "report": "Teacher Beatrice (0723825032) called to be taken through the process of registering the students.I took her through the process and she was able to register the students thus issue resolved.", "serial_number": "GOKMOESTTDD2014388", "error_code": "TDD-NETSUPPORT"}}, {"pk": 723905, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207011, "date": "2017-07-20", "report": "LDD- AUTOMATIC REPAIR Mr Solomon 705756483 called concerned that this device had error 'automatic repair' when he powered it on. I advised him to cold boot the device and he was able to see the desktop icons. Issue resolved.", "serial_number": "gokmoestldd2218482", "error_code": "LDD-IMAGE"}}, {"pk": 845913, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207015, "date": "2017-07-06", "report": "Mr Simon Chege 780510943 called  in regards to this devices which he had logged in as an administrator. I advised him to cold reboot the device and use the student account to sign in and always use the student account on the ldd while signing in. He was able to see the desk top icon, the device worked properly.", "serial_number": "gokmoestldd2232172", "error_code": "LDD-SOFTWARE"}}, {"pk": 194111, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207024, "date": "2017-06-09", "report": "TDD- HANGING Madam Ann 0726601104 called concerned that she was unable to open icons from the desktop. I advised her to cold boot the device by long pressing on the power button until the device shuts down and then power it back on. I then advised her to try opening a content by double clicking on the Icons but it was not responding. I then advised her to cold boot the device again and try opening the icons by right clicking and it worked. She also wanted to mute the LDDS using the net support and I took her through the procedure and it worked.", "serial_number": "GOKMOESTTDD2014318", "error_code": "TDD - HANGING"}}, {"pk": 701501, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207024, "date": "2017-06-14", "report": "Madam Laura 726601104 called in regards to this device which she was using the net-support and when she uses the show function the ldds produce a lot of whizzing sound that it distracts the lesson. I advised her to disable the microphone and play the subject again on the show function and she could not hear the whizzing sound again. Issue Resolved.", "serial_number": "GOKMOESTTDD2014365", "error_code": "TDD - SOUND"}}, {"pk": 984889, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207030, "date": "2017-06-20", "report": "Madam Mercy 719201257  called us today in regards to this device which was showing a slanted image. I advised him to use the keystone keys to adjust to the correct side, and also use the tilt adjuster nob to get the correct image display. She was able to get the perfect image. Issue resolved.", "serial_number": "q72g646aaaaac1939", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 984889, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207030, "date": "2017-06-20", "report": "Madam Mercy 719201257  called us today in regards to this device which was showing a slanted image. I advised him to use the keystone keys to adjust to the correct side, and also use the tilt adjuster nob to get the correct image display. She was able to get the perfect image. Issue resolved.", "serial_number": "q72g646aaaaac1939", "error_code": "PROJECTOR-DISPLAY"}}, {"pk": 641217, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206981, "date": "2017-07-06", "report": "John Mwangi called us today 724487993 concerned that one of the ldd  was showing an error message of  automatic repair, I advised him to cold boot the device and upon powering on the device it worked properly. Issue resolved", "serial_number": "gokmoestldd2213817", "error_code": "LDD-IMAGE"}}, {"pk": 641217, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206981, "date": "2017-07-06", "report": "John Mwangi called us today 724487993 concerned that one of the ldd  was showing an error message of  automatic repair, I advised him to cold boot the device and upon powering on the device it worked properly. Issue resolved", "serial_number": "gokmoestldd2213817", "error_code": "LDD-IMAGE"}}, {"pk": 675757, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207039, "date": "2017-06-16", "report": "Teacher Mwangi(0726163970) concerned about this device producing a whizzing sound while opening the files.I advised him to cold boot the device and after doing so,the whizzing sound was not present at all thus resolved.", "serial_number": "GOKMOESTLDD2264677", "error_code": "LDD-SOUND"}}, {"pk": 219279, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206786, "date": "2017-07-28", "report": "Madam Catherine 726066423 called concerned that this device was requesting for administrator password. I took her through the procedure of signing in using the student account and she was able to. She said that they received the devices on Thursday last week but a technician did not visit the school to do installation. I advised her to wait for installation to take place before they can start using the devices.", "serial_number": "GOKMOESTLDD2302510", "error_code": "LDD-SOFTWARE"}}, {"pk": 219279, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 206786, "date": "2017-07-28", "report": "Madam Catherine 726066423 called concerned that this device was requesting for administrator password. I took her through the procedure of signing in using the student account and she was able to. She said that they received the devices on Thursday last week but a technician did not visit the school to do installation. I advised her to wait for installation to take place before they can start using the devices.", "serial_number": "GOKMOESTLDD2302510", "error_code": "LDD-SOFTWARE"}}, {"pk": 806114, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207261, "date": "2016-08-05", "report": "The teacher called in regards to this device, she was trying to access the net support the send and collect function, i took her through the process of sending and collecting work and she was able to send and collect work.", "serial_number": "GOKMOESTTDD2000048", "error_code": "TDD-NETSUPPORT"}}, {"pk": 162262, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207261, "date": "2016-08-08", "report": "The teacher called to report on this device that had a brought an error message that she could not really explain well,the error came when the student was using the device.i advised the teacher to cold reboot the device and the device was now working well.", "serial_number": "GOKMOESTLDD2002513", "error_code": "LDD-OTHER"}}, {"pk": 910886, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207261, "date": "2016-09-26", "report": "LDD TASK BAR-A teacher by the name Beatrice(0724269142) called in regards to this device whose task bar was half the screen and i was able to direct her to drag it down to the size that she was comfortable with and she confirmed it was working well.issue resolved at l1", "serial_number": "GOKMOESTLDD2000002", "error_code": "LDD - SOFTWARE"}}, {"pk": 272979, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207261, "date": "2016-09-30", "report": "Beatrice-0724269142 from Gathuku Mundu called with a concern of TDD producing a funny sound on the speakers like a scratch when she plays a content, I advise her to call reboot the TDD and after that the devices responded and the speakers were producing good sound", "serial_number": "GOKMOESTTDD2000048", "error_code": "TDD - SOUND"}}, {"pk": 450959, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207261, "date": "2017-01-24", "report": "Teacher Beatrice 0724269142 called from GATHUKI MUNDU concerned about the LDD having a lot of copy pasted documents on the desktop and i therefore advised on how to undo all the copy pasted documents and she affirmed she will calling us back in 20min time to update us of the developments thus pending. Teacher Beatrice called back to inform us that this device is now working well after she undid all the copy pasted documents.", "serial_number": "GOKMOESTLDD2001020", "error_code": "LDD - SOFTWARE"}}, {"pk": 252396, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207261, "date": "2017-02-01", "report": "TDD CONTENT  Beatrice-0724269142 from Gathuki Mundu called with a concern of a TDD which she explains has disconnected the content which she was showing to the student. She says she was using content from Connect Server AP.I advised her to use the content which is on the desktop depending on the class she is in. Resolved", "serial_number": "GOKMOESTTDD2000048", "error_code": "TDD - CONTENT"}}, {"pk": 376270, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207261, "date": "2017-02-10", "report": "LDD- SOUND  Madam Beatrice 0724269142 called concerned that this device was producing a whizzing sound when she tried playing a content. I advised her to cold boot the device by long pressing on the power button then power it back on. I advised her to play a content and the issue was solved.", "serial_number": "GOKMOESTLDD2000686", "error_code": "LDD - SOUND"}}, {"pk": 53396, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207115, "date": "2017-06-07", "report": "LDD- SOFTWARE Mr Mwangi 0727880724 called concerned that he was unable top see the desktop icons. I advised him to click on the action center and disable the tablet mode and he was now able to see the desktop icons. Issue resolved.", "serial_number": "GOKMOESTLDD1135048", "error_code": "LDD - SOFTWARE"}}, {"pk": 254331, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207115, "date": "2017-06-16", "report": "TDD- HANGING Mr Peter 0727880724 called concerned that he was unable to sign in using this device. I advised him to cold boot the device by long pressing on the power button until the device shuts down then power it back on. He confirmed that the device was now working well and he could see the desktop. Issue resolved.", "serial_number": "GOKMOESTtDD1001565", "error_code": "TDD-HANGING"}}, {"pk": 245530, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207115, "date": "2017-06-19", "report": "TDD- CONTENT Mr Mwangi 0727880724 called concerned that he was unable to navigate through the science content. I advised him to launch the science content but the call got disconnected before we could continue the procedure. He called us back and i advised him to close the content and open the content again. Then i took him through the content and showed him how to use the arrows for moving to the next subtopics and to the next topic. The issue was resolved.", "serial_number": "GOKMOESTtDD1001565", "error_code": "TDD-CONTENT"}}, {"pk": 196762, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207115, "date": "2017-06-28", "report": "Mr Mwangi 0727880724 called concerned that he was unable to navigate through the science content. I advised him to launch the science content then took him through the navigation through the use of the up and down buttons and the zooming and maximizing  buttons thus solved", "serial_number": "GOKMOESTTDD1001565", "error_code": "TDD-CONTENT"}}, {"pk": 644840, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207319, "date": "2017-08-30", "report": "Mr Robert 725894934 called in regards to this device which was asking for net support activation,i advised him to get a smart phone which he confirmed he had and it was loaded with bundles so i advised him to create a hot spot and connect to the TDD then launch the net support then click on activate. He was able to activate the net support and the device worked properly. Issue resolved.", "serial_number": "gokmoesttdd1001816", "error_code": "TDD-NETSUPPORT-ACTIVATION"}}, {"pk": 323326, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207243, "date": "2017-02-08", "report": "TDD NETWORK CONNECTION AND NAVIGATION OF NET SUPPORT  Mrs.Mukuria called to be assisted on how she can use NetSupport.I took her through the process of connecting this device to the CAP network by advising her to select the Network icon on the notification area and connect to the CAP Network which she was successful. I then advised her to open the Net support and explain if she was able to see students on the Net support, which she said she could see 5 students and I told her she can connect the rest later. I asked her to click the show Menu on the Net support toolbar and she was able to show her desktop to the 5 students. PROBLEM SOLVED", "serial_number": "GOKMOESTTDD1000714", "error_code": "TDD - SOFTWARE"}}, {"pk": 833440, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207243, "date": "2017-02-08", "report": "LDD NETWORK CONNECTION Mrs.Mukuria called to be assisted on how she can connect this device to the CAP network. I took her through the process of connecting this device to the CAP network by advising her to select the Network icon on the notification area and connect to the CAP Network which she was successful.", "serial_number": "GOKMOESTLDD1142596", "error_code": "LDD - SOFTWARE"}}, {"pk": 698895, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207243, "date": "2017-02-15", "report": "Madam LYDIA( 0713132622)called concerned that the device was not powering on and the LED light was red. Since there was no electricity in the school,i advised her to charge the device for 6 hours when the electricity will be there then call to confirm if the device is charging .On making a callback,she confirmed that the device was charged and could power on", "serial_number": "GOKMOESTLDD1142375", "error_code": "LDD - NOT POWERING ON"}}, {"pk": 810569, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207243, "date": "2017-02-15", "report": "LDD- WINDOWS COULD NOT BOOT CORRECTLY We called teacher Lydia to make a follow up on the devices and the teacher said that this device was giving a windows boot up error. I advised her to cold reboot the device and on powering it on the  device was okay. Problem solved.", "serial_number": "GOKMOESTLDD1134291", "error_code": "LDD - SOFTWARE"}}, {"pk": 597681, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207243, "date": "2017-03-09", "report": "LDD- WHIZZING SOUND  Madam Lydia 0713132622 called in regards to this device that was producing a whizzing sound when she tried playing a content. I advised her to cold boot the device by long pressing on the power button until it powers off then try powering it on. I advised her to play a subject from the desktop and the device was now working well.", "serial_number": "GOKMOESTLDD1170896", "error_code": "LDD - SOUND"}}, {"pk": 129606, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207298, "date": "2017-03-16", "report": "TDD- NET SUPPORT Activation  Maina 0723063870 called in regards to this device which was asking for net support activation when he tried launching the net support. I advised him to call us back when he has loaded internet bundles on his phone in order to trouble shoot.  Mr.Karanja-723063870 called as advised after loading his phone with bundles and I was able to assist him activate the Net support", "serial_number": "GOKMOESTtdd2002747", "error_code": "TDD-NETSUPPORT ACTIVATION"}}, {"pk": 129606, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207298, "date": "2017-03-16", "report": "TDD- NET SUPPORT Activation  Maina 0723063870 called in regards to this device which was asking for net support activation when he tried launching the net support. I advised him to call us back when he has loaded internet bundles on his phone in order to trouble shoot.  Mr.Karanja-723063870 called as advised after loading his phone with bundles and I was able to assist him activate the Net support", "serial_number": "GOKMOESTtdd2002747", "error_code": "TDD-NETSUPPORT ACTIVATION"}}, {"pk": 233602, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207101, "date": "2017-07-10", "report": "Madam Eunice 714370929 called concerned that she was unable to connect this device and one LDD to the CAP network. She confirmed that the CAP was powered on and that it had a blinking blue LED light. I then took her through the procedure of connecting the devices to the CAP network and it worked.", "serial_number": "GOKMOESTTDD2014493", "error_code": "TDD-NETWORK"}}, {"pk": 764211, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207103, "date": "2017-07-10", "report": "Teacher Susan Maina 733533815 called to get assistance on how to connect this device to the CAP network. She informed me that she had gone through the connection process but could not access the CAP. I advised her to explain how the network icon looked like and she confirmed to see a yellow triangle on the icon. I then assisted her on how to access the content from the cap. Problem solved", "serial_number": "gokmoesttdd2014881", "error_code": "TDD-NETWORK"}}, {"pk": 764211, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207103, "date": "2017-07-10", "report": "Teacher Susan Maina 733533815 called to get assistance on how to connect this device to the CAP network. She informed me that she had gone through the connection process but could not access the CAP. I advised her to explain how the network icon looked like and she confirmed to see a yellow triangle on the icon. I then assisted her on how to access the content from the cap. Problem solved", "serial_number": "gokmoesttdd2014881", "error_code": "TDD-NETWORK"}}, {"pk": 665230, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207108, "date": "2017-07-10", "report": "Madam Cecilia 726717454  called concerned that she was unable to open files by double clicking on the file on this device. She said that she was able to open files by right clicking to open. I advised her to continue using the that procedure.", "serial_number": "GOKMOESTTDD2011710", "error_code": "TDD-SOFTWARE"}}, {"pk": 545610, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207150, "date": "2017-07-07", "report": "Madam Grace called us today in regards to this two TDD which were hanging . I advised her to cold reboot the device and after powering on the device she was able to navigate through the device and the issue was resolved.RESOLVED.", "serial_number": "gokmoesttdd2007737", "error_code": "TDD-HANGING"}}, {"pk": 696301, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207150, "date": "2017-07-07", "report": "Madam Grace called us today  in regards to this two TDD which were hanging . I advised her to cold reboot the device and after powering on the device she was able to navigate through the device and the issue was resolved.RESOLVED.", "serial_number": "gokmoesttdd2014033", "error_code": "TDD-HANGING"}}, {"pk": 749160, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207089, "date": "2017-07-11", "report": "Mr Nelson called today, concerned about this device which was not powering on. I advised the teacher to use the correct ldd charger and plug in to the device and he was able to see a red light but upon pressing the power button the device did not respond but his call disconnected We later called back and Mr Nelson 0722270971 confirmed that the device powered on after letting the device charge fully.", "serial_number": "GOKMOESTLDD2214297", "error_code": "LDD-NOT-POWERING-ON"}}, {"pk": 978070, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207118, "date": "2017-07-26", "report": "Madam Lilian 728764475 called us today in regards to this device which was hanging. I advised the teacher to cold reboot the device and upon powering on the device worked properly. Issue resolved.", "serial_number": "gokmoesttdd2014743", "error_code": "TDD-HANGING"}}, {"pk": 358880, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207280, "date": "2017-07-11", "report": "Teacher Maina 705465763 called that this Ldd was not having desktop icons but i could not assist him because he could not hear me clearly from his side.  Mr Maina 705465763 called back concerned that he was unable to see the desktop icons. I took him through the procedure of cold booting the device and he was now able to see the desktop icons. Issue resolved.", "serial_number": "GOKMOESTLDD2200541", "error_code": "LDD-SOFTWARE"}}, {"pk": 691500, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207280, "date": "2017-07-11", "report": "Mr Maina 705465763 called concerned that he was unable to connect this device to the CAP network. I advised him to power on the device and took him through the procedure of connecting this device to the CAP network and he was able to. Issue resolved", "serial_number": "gokmoestldd2223602", "error_code": "LDD-NETWORK"}}, {"pk": 684021, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207280, "date": "2017-07-11", "report": "Mr Maina 705465763 called concerned that this device had error 'automatic repair restart your device' when he powered it on. I then advised him to cold boot the device and he was able to see the desktop. Issue resolved.", "serial_number": "gokmoestldd2206504", "error_code": "LDD-IMAGE"}}, {"pk": 642171, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 207340, "date": "2017-07-11", "report": "Mr Ngumi 726724112 called us today, he was concerned that one of the TDD was hanging.  I advised the teacher to cold reboot the device and after powering on the device he was able to navigate through the device. Issue resolved.", "serial_number": "Gokmoesttdd2012020", "error_code": "TDD-HANGING"}}, {"pk": 278568, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 209610, "date": "2017-07-11", "report": "Mr.Lesimalele called to report he is not able to sign in on the teachers account because the device was hanging .I advised him to cold reboot the device and on powering on, the device responded and he was able to sign  thus solved.", "serial_number": "GOKMOESTTDD2011945", "error_code": "TDD-HANGING"}}, {"pk": 970495, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202963, "date": "2017-05-24", "report": "Teacher Victor (0727428427)called concerned about this device unable to respond to teachers sign in.I advised him to cold reboot and the device was now able to respond thus solved", "serial_number": "GOKMOESTTDD2003861", "error_code": "TDD - HANGING"}}, {"pk": 932527, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203123, "date": "2017-03-14", "report": "Teacher Purity 2147483647 called us today, to inform us that she was only able to see 7 ldds on the net-support, while the class had 26 ldds. I advised her to confirm that the cap is on and take one ldd and power on the TDD gokmoesttdd2001053 and i took her through connecting the devices to the cap network by going to the action center and clicking on the available network and chose the connect sever AP and she was able to connect the devices to the cap network and was able to see the student on the net-support.", "serial_number": "gokmoestldd2059709", "error_code": "LDD-NETSUPPORT"}}, {"pk": 556177, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203106, "date": "2017-03-04", "report": "Teacher Casty(0723941925) called today in regards to this device that was not connecting to the cap network, I advised her to power on the cap[ 1c497d92f525] and she said she could see a blue led light on top of the cap. The TDD was powered on, so i took her through the action center, however her call disconnected before we could finish the trouble shooting procedure.She called back ,then i took her through the connection process via the action center-go to setting then connect to the Cap network thus resolved", "serial_number": "gokmoesttdd2003792", "error_code": "TDD - NETSUPPORT"}}, {"pk": 227272, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203106, "date": "2017-03-09", "report": "TDD- NET SUPPORT. Madam Casty 0723941925 called concerned that she was unable to use the student register on the the net support. I took her through the procedure of connecting the device to the CAP network. I then advised her to  connect one LDD and prompt the student to register and it worked. I advised her to always ensure the devices are connected to the CAP network whenever she wants to use the net support.", "serial_number": "GOKMOESTTDD2003792", "error_code": "TDD - NETSUPPORT"}}, {"pk": 734112, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203106, "date": "2017-04-03", "report": "TDD- NET SUPPORT ACTIVATION Madam Casty from Chuka township primary school Tharakanithi county called concerned that this  device was requesting for Net support license activation code when she tried using the net support. I advised her to load her phone with internet bundles then call us back using another phone for us to take her through the procedure of net support activation. We later made a follow up and she confirmed that she was able to activate the net support and the device was working well.", "serial_number": "GOKMOESTTDD2002968", "error_code": "TDD-NETSUPPORT ACTIVATION"}}, {"pk": 358851, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203106, "date": "2017-06-30", "report": "TDD- NET SUPPORT.  Madam Casty 0723941925 called concerned that she was unable to use the send/ collect work on the net support. I advised her to connect the TDD and the ldd to the cap network, then go to word and create the question which she wanted to send to the student. Then on the net support she was able to send work to the student and collect it successful. Issue resolved.", "serial_number": "GOKMOESTTDD2003792", "error_code": "TDD-NETSUPPORT"}}, {"pk": 533439, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203106, "date": "2017-07-13", "report": "Madam Casty 723941925 called concerned that this device was requesting for Net support license activation code when she tried using the net support. I advised her to load her phone with internet bundles then call us back using another phone for us to take her through the procedure of net support activation.She called back and i took her through the tethering on her phone then activating the netsupport online thus issue solved.", "serial_number": "gokmoesttdd2002968", "error_code": "TDD-NETSUPPORT-ACTIVATION"}}, {"pk": 475966, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202960, "date": "2017-06-22", "report": "Mr Kinywa 720221256 called us today, in regards to this device which was not connecting to the cap network. I advised her to power on the cap and the TDD which she confirmed that the devices were on. I advised him to go to the action center and after turning on the Wi-Fi she was able to connect the cap network and the device worked properly.", "serial_number": "GOKMOESTTDD2004495", "error_code": "TDD-NETWORK"}}, {"pk": 517746, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203220, "date": "2017-05-17", "report": "TDD NETWORK CONNECTION Mr.Edwin – 729094118 called today to be assisted on how to connect this device to the CAP Network. I was able to take him through the process by advising him to go on the action centre, click on the all settings option, click on Network and Internet and then connect to the CAP Network which he did successfully.PROBLEM SOLVED", "serial_number": "GOKMOESTTDD2004294", "error_code": "TDD-NETWORK"}}, {"pk": 705727, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203220, "date": "2017-05-17", "report": "LDD NETWORK CONNECTION Mr. Edwin – 729094118 called today to be assisted on how to connect this device to the CAP Network. I was able to take him through the process by advising him to go on the action centre, click on the all settings option, click on Network and Internet and then connect to the CAP Network which he did successfully. PROBLEM SOLVED", "serial_number": "GOKMOESTLDD2119287", "error_code": "LDD-NETWORK"}}, {"pk": 82335, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203220, "date": "2017-05-17", "report": "LDD NETWORK CONNECTION Mr. Edwin – 729094118 called today to be assisted on how to connect this device to the CAP Network. I was able to take him through the process by advising him to go on the action centre, click on the all settings option, click on Network and Internet and then connect to the CAP Network which he did successfully. PROBLEM SOLVED", "serial_number": "GOKMOESTLDD2132138", "error_code": "LDD-NETWORK"}}, {"pk": 371634, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203220, "date": "2017-06-13", "report": "Teacher Edwin(0729094118) called concerned to be shown how to use the show function .I took him through the process and he confirmed this but viewing the same content from the TDD  on the LDDS thus issue solved.", "serial_number": "GOKMOESTTDD2004294", "error_code": "TDD - NETSUPPORT"}}, {"pk": 372735, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203220, "date": "2017-06-13", "report": "Teacher Edwin(0729094118) called concerned about this device having a blank screen.I advised him to col boot the device and after doing so more than 3 times the device was now ok  thus solved.", "serial_number": "GOKMOESTTDD2005635", "error_code": "TDD-DISPLAY"}}, {"pk": 993993, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 202754, "date": "2017-07-10", "report": "Teacher Grace 723264610 called for assistance on how to connect the devices to the CAP network. I advised her to power on the CAP and confirm if she could see a blue blinking light which she did. I then requested her to power on the TDD and open the action center but the call disconnected before she could do that. We later called back and Madam Grace confirmed that the device is now working well.", "serial_number": "GOKMOESTTDD2004411", "error_code": "TDD-NETWORK"}}, {"pk": 902293, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 203091, "date": "2017-07-13", "report": "Mr Kamara called 720170921 concerned that he was unable to see the LDDS that were connected to the CAP network on the net support of this device. As I was taking him through the procedure of connecting this device to the CAP the teacher disconnected the call. We later called the teacher and took him through the connecting to the cap network and the device worked properly. Issue resolved.", "serial_number": "GOKMOESTtDD2016542", "error_code": "TDD-NETSUPPORT"}}, {"pk": 771657, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 201660, "date": "2017-01-26", "report": "Mr.Kennedy a teacher(0763642272) from  KOTULO  called concerned that he could not locate the network icon and therefore took him through the process of locating the network icon and thus was able to navigate through.", "serial_number": "GOKMOESTTDD1001905", "error_code": "TDD - SOFTWARE"}}, {"pk": 67933, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 201660, "date": "2017-01-26", "report": "REGISTERING STUDENT ON NET SUPPORT   Mr. Hassan- 0763642272 from Kutulo Primary School in Wajir County called to be assisted on how he can register students permanently on the Net Support. I advised him to register one student then on the task bar to click on view and select current setting then click on tutor he will see a drop down which he will tick on the remember student username, He was able to follow the procedure and before confirming if the Net support can remember the student username the call disconnected.  He later called back to confirm that he has managed to Permanently register the student usernames on the Net Support .", "serial_number": "GOKMOESTTDD1001905", "error_code": "TDD - NETSUPPORT"}}, {"pk": 921355, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 201660, "date": "2017-04-29", "report": "Mr.Hassan (0763642272) called concerned about some alphabetical keys on the TDD typing numerical instead while using the Microsoft word  .I therefore advised him to click the Fn key +Num Lk key so us to disable the numerical function thus issue solved.", "serial_number": "GOKMOESTTDD1001905", "error_code": "TDD - SOFTWARE"}}, {"pk": 471303, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 201646, "date": "2017-09-04", "report": "Madam Christine 720336808 called concerned that she was unable to view the connected students on the net support. I took her through the procedure of connecting one LDD to the CAP network and she was able to. I then advised her to launch the net support and she was now able to view the connected student. Issue resolved.", "serial_number": "GOKMOESTtDD2011618", "error_code": "TDD-NETSUPPORT"}}, {"pk": 370708, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 201646, "date": "2017-09-04", "report": "Madam Christine 720336808 called concerned that she was unable to register the students.I took her the process and she was able to register the students thus issue resolved.", "serial_number": "GOKMOESTTDD2011618", "error_code": "TDD-NETSUPPORT"}}, {"pk": 397301, "model": "geoapp.issue", "fields": {"status": "Resolved", "technical_report": "", "school": 201663, "date": "2017-09-07", "report": "Mr Ismail 710783333 called concerned that he was unable to connect this device to the CAP network. I advised him to click on all setting in the action center but it could not respond. I then advised him to cold boot the device and he was able to. I advised him to click on all settings in the action center then network and internet and showed him how to connect this device to the CAP network and it worked. Issue resolved.", "serial_number": "GOKMOESTTDD2011529", "error_code": "TDD-NETWORK"}}]